var mainData = [
    {
        "title": "每课一考（第一课）",
        "subtitle":"第一课",
        "testdate":"2023-01-31 (Week 5)",
        "words": ["合适","朋友","很多","现在","校车","专心","有点儿大","我今年(读)二年(级)","姐姐的个子不高","我会写字,还会画画","裤样阿请钱试","些对被照顾"]
    },
    {
        "title": "每课一考（第二课）",
        "subtitle":"第二课",
        "testdate":"2023-02-07 (Week 6)",
        "words": ["您好","学业","几岁","买花","一条龙","一张卡","拿给她","我祝爸爸生日快乐","弟弟还小,不会写华文字","到学校门口时","我对妈妈说再见","新表演候接","着谢蛋啊"]
    },
    {
        "title": "每课一考（第三课）",
        "subtitle":"第三课",
        "testdate":"2023-02-21 (Week 8)",
        "words": ["主人","耳","小狗","非常","没有","两片肉干","一杯汽水","三只羊在草地上吃草","快把门打开,客人来了!","爸妈去买东西,我在家里看书","糕纸忙原吧定第得"]
    },
    {
        "title": "每课一考（第四课）",
        "subtitle":"第四课",
        "testdate":"2023-02-28 (Week 9)",
        "words": ["云朵","天空","太阳","一棵(树)","一片(树)林","五支红笔","一排汽车","文文画出了几条小鱼","妹妹先写字,再吃东西","小乐送了一张生日卡片给妈妈","直然拉蓝绿黄黑路呢"]
    },
    {
        "title": "每课一考（第五课）",
        "subtitle":"第五课",
        "testdate":"2023-03-07 (Week 10)",
        "words": ["请坐","很远","一直","左边","运动","向后","已经","学校的音乐(室)在三楼","小明从办公(室)走出来","同学们在学校用心学习","哪旁转男迷坡久答"]
    }
]