var mainData = [
    {
        "title": "每课一考（第一课）",
        "subtitle":"第一课",
        "testdate":"2023-01-31 (Term 1 Week 5)",
        "words": ["合适","朋友","很多","现在","校车","专心","有点儿大","我今年(读)二年(级)","姐姐的个子不高","我会写字,还会画画","裤样阿请钱试","些对被照顾"]
    },
    {
        "title": "每课一考（第二课）",
        "subtitle":"第二课",
        "testdate":"2023-02-07 (Term 1 Week 6)",
        "words": ["您好","学业","几岁","买花","一条龙","一张卡","拿给她","我祝爸爸生日快乐","弟弟还小,不会写华文字","到学校门口时","我对妈妈说再见","新表演候接","着谢蛋啊"]
    },
    {
        "title": "每课一考（第三课）",
        "subtitle":"第三课",
        "testdate":"2023-02-21 (Term 1 Week 8)",
        "words": ["主人","耳","小狗","非常","没有","两片肉干","一杯汽水","三只羊在草地上吃草","快把门打开,客人来了!","爸妈去买东西,我在家里看书","糕纸忙原吧定第得"]
    },
    {
        "title": "每课一考（第四课）",
        "subtitle":"第四课",
        "testdate":"2023-02-28 (Term 1 Week 9)",
        "words": ["云朵","天空","太阳","一棵(树)","一片(树)林","五支红笔","一排汽车","文文画出了几条小鱼","妹妹先写字,再吃东西","小乐送了一张生日卡片给妈妈","直然拉蓝绿黄黑路呢"]
    },
    {
        "title": "每课一考（第五课）",
        "subtitle":"第五课",
        "testdate":"2023-03-07 (Term 1 Week 10)",
        "words": ["请坐","很远","一直","左边","运动","向后","已经","学校的音乐(室)在三楼","小明从办公(室)走出来","同学们在学校用心学习","哪旁转男迷坡久答"]
    },
    {
        "title": "每课一考（第六课）",
        "subtitle":"第六课",
        "testdate":"2023-03-28 (Term 2 Week 2)",
        "words": ["行人","明亮","互相","旁边","美丽","过马路","跑出去","姐姐扫了地才吃东西。","书包里有书本和文具。","在学校里，我们看见老师要说早安。","班应该桥等停极热闹骑"]
    },
    {
        "title": "每课一考（第七课）",
        "subtitle":"第七课",
        "testdate":"2023-04-11 (Term 2 Week 4)",
        "words": ["收拾","走进","红豆","排队","吃完早饭","一杯奶茶","一位老师","妹妹开心地笑了。","弟弟要买书，不要买玩具。","大家分工合(作)，","把家里打扫干(净)。","炒油炸冰温找座","特别闻味懂"]
    },
    {
        "title": "每课一考（第八课）",
        "subtitle":"第八课",
        "testdate":"2023-04-25 (Term 2 Week 6)",
        "words": ["种花","让位","广场","谈天","灭火","全卖完","抓坏人","我爸爸是园丁。","他住的地方发生了火灾。","我妈妈是(演)员，她会(演)(戏)","医病护教保建"]
    },
    {
        "title": "每课一考（第九课）",
        "subtitle":"第九课",
        "testdate":"2023-05-09 (Term 2 Week 8)",
        "words": ["雨伞","身体","响(声)","闪电","淋雨","打雷","刮大风","这是小乐的衣服。","你怎么没(带)书包出门(呢)？","昨天是(晴)天，","今天是(阴)天。","冷怕忘记急铃湿成共"]
    },
    {
        "title": "每课一考（第十课）",
        "subtitle":"第十课",
        "testdate":"2023-05-23 (Term 2 Week 10)",
        "words": ["喜欢","别人","树枝","叶子","吃饱","一张网","捉虫子","弟弟在水池边采花 。","书包里有书本和文具。","在学校里，","我们看见老师要说早安。","班应该桥等停极热闹骑"]
    }
]