var mainData = [
  {
    title: "第十五课 - 华文真有趣",
    subtitle: "2024 第十五课",
    testdate: "2024-09-24 (Term 4 Week 3)",
    words: [
      "偷东西、两腿发软",
      "冒出冷汗",
      "全身发抖",
      "痛、花丛、蜜蜂",
      "肚皮、笔画",
      "偷偷地",
      "忍不住、钻、不然",
      "闹笑话、不敢",
      "马虎",
      "小偷、窗口",
      "礼堂、吓了一跳",
      "腿、逃走",
      "冒冷汗、发抖",
      "假期、简单",
      "座位、交作业",
      "哈哈大笑",
      "吓了一跳",
      "两腿发软",
      "冒出冷汗",
      "全身发抖",
      "赶快逃走",
      "打开窗口",
      "学校假期",
      "哈哈大笑",
      "他急得像热锅上的蚂蚁。",
      "他忙得像花丛中的蜜蜂。",
      "我吓得冷汗直流，手脚发软",
      "不敢看妈妈严厉的目光。"
    ]
  }
];
