var mainData = [
    {
        "title": "劝学(节选)",
        "subtitle": "(先秦)荀子",
        "paragraph": [
            { "bodytext": "君子曰：学不可以已。" },
            { "bodytext": "青，取之于蓝，而青于蓝；冰，水为之，而寒于水。木直中绳，輮以为轮，其曲中规。虽有槁暴，不复挺者，輮使之然也。故木受绳则直，金就砺则利，君子博学而日参省乎己，则知明而行无过矣。" },
            { "bodytext": "吾尝终日而思矣，不如须臾之所学也；吾尝跂而望矣，不如登高之博见也。登高而招，臂非加长也，而见者远；顺风而呼，声非加疾也，而闻者彰。假舆马者，非利足也，而致千里；假舟楫者，非能水也，而绝江河。君子生非异也，善假于物也。" },
            { "bodytext": "积土成山，风雨兴焉；积水成渊，蛟龙生焉；积善成德，而神明自得，圣心备焉。故不积跬步，无以至千里；不积小流，无以成江海。骐骥一跃，不能十步；驽马十驾，功在不舍。锲而舍之，朽木不折；锲而不舍，金石可镂。蚓无爪牙之利，筋骨之强，上食埃土，下饮黄泉，用心一也。蟹六跪而二螯，非蛇鳝之穴无可寄托者，用心躁也。" },
        ]
    },
    {
        "title": "三字经(一)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "人之初，性本善，性相近，习相远，苟不教，性乃迁。" },
            { "bodytext": "教之道，贵以专，昔孟母，择邻处，子不学，断机杼。" },
            { "bodytext": "窦燕山，有义方，教五子，名俱扬，养不教，父之过。" },
            { "bodytext": "教不严，师之惰，子不学，非所宜，幼不学，老何为。" },
            { "bodytext": "玉不琢，不成器，人不学，不知义，为人子，方少时。" },
            { "bodytext": "亲师友，习礼仪，香九龄，能温席，孝于亲，所当执。" },
            { "bodytext": "融四岁，能让梨，弟于长，宜先知，首孝弟，次见闻。" },
            { "bodytext": "知某数，识某文，一而十，十而百，百而千，千而万。" }
        ]
    },
    {
        "title": "三字经(二)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "三才者，天地人，三光者，日月星，三纲者，君臣义。" },
            { "bodytext": "父子亲，夫妇顺，曰春夏，曰秋冬，此四时，运不穷。" },
            { "bodytext": "曰南北，曰西东，此四方，应乎中，曰水火，木金土。" },
            { "bodytext": "此五行，本乎数，曰仁义，礼智信，此五常，不容紊。" },
            { "bodytext": "稻粱菽，麦黍稷，此六谷，人所食，马牛羊，鸡犬豕。" },
            { "bodytext": "此六畜，人所饲，曰喜怒，曰哀惧，爱恶欲，七情具。" },
            { "bodytext": "匏土革，木石金，丝与竹，乃八音，高曾祖，父而身。" },
            { "bodytext": "身而子，子而孙，自子孙，至玄曾，乃九族，人之伦。" }
        ]
    },
    {
        "title": "三字经(三)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "父子恩，夫妇从，兄则友，弟则恭，长幼序，友与朋。" },
            { "bodytext": "君则敬，臣则忠，此十义，人所同，凡训蒙，须讲究。" },
            { "bodytext": "详训诂，名句读，为学者，必有初，小学终，至四书。" },
            { "bodytext": "论语者，二十篇，群弟子，记善言，孟子者，七篇止。" },
            { "bodytext": "讲道德，说仁义，作中庸，乃孔伋，中不偏，庸不易。" },
            { "bodytext": "作大学，乃曾子，自修齐，至平治，孝经通，四书熟。" },
            { "bodytext": "如六经，始可读，诗书易，礼春秋，号六经，当讲求。" },
            { "bodytext": "有连山，有归藏，有周易，三易详，有典谟，有训诰。" }
        ]
    },
    {
        "title": "三字经(四)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "有誓命，书之奥，我周公，作周礼，著六官，存治体。" },
            { "bodytext": "大小戴，注礼记，述圣言，礼乐备，曰国风，曰雅颂。" },
            { "bodytext": "号四诗，当讽咏，诗既亡，春秋作，寓褒贬，别善恶。" },
            { "bodytext": "三传者，有公羊，有左氏，有谷梁，经既明，方读子。" },
            { "bodytext": "撮其要，记其事，五子者，有荀杨，文中子，及老庄。" },
            { "bodytext": "经子通，读诸史，考世系，知终始，自羲农，至黄帝。" },
            { "bodytext": "号三皇，居上世，唐有虞，号二帝，相揖逊，称盛世。" },
            { "bodytext": "夏有禹，商有汤，周文武，称三王，夏传子，家天下。" }
        ]
    },
    {
        "title": "三字经(五)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "四百载，迁夏社，汤伐夏，国号商，六百载，至纣亡。" },
            { "bodytext": "周武王，始诛纣，八百载，最长久，周辙东，王纲堕。" },
            { "bodytext": "逞干戈，尚游说，始春秋，终战国，五霸强，七雄出。" },
            { "bodytext": "嬴秦氏，始兼并，传二世，楚汉争，高祖兴，汉业建。" },
            { "bodytext": "至孝平，王莽篡，光武兴，为东汉，四百年，终于献。" },
            { "bodytext": "魏蜀吴，争汉鼎，号三国，迄两晋，宋齐继，梁陈承。" },
            { "bodytext": "为南朝，都金陵，北元魏，分东西，宇文周，与高齐。" },
            { "bodytext": "迨至隋，一土宇，不再传，失统绪，唐高祖，起义师。" }
        ]
    },
    {
        "title": "三字经(六)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "除隋乱，创国基，二十传，三百载，梁灭之，国乃改。" },
            { "bodytext": "梁唐晋，及汉周，称五代，皆有由，炎宋兴，受周禅。" },
            { "bodytext": "十八传，南北混，辽与金，皆称帝，元灭金，绝宋世。" },
            { "bodytext": "舆图广，超前代，九十年，国祚废，太祖兴，国大明。" },
            { "bodytext": "号洪武，都金陵，迨成祖，迁燕京，十六世，至崇祯。" },
            { "bodytext": "权阉肆，寇如林，李闯出，神器焚，清世祖，应景命。" },
            { "bodytext": "靖四方，克大定，古今史，全在兹，载治乱，知兴衰。" },
            { "bodytext": "读史书，考实录，通古今，若亲目，口而诵，心而惟。" }
        ]
    },
    {
        "title": "三字经(七)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "朝于斯，夕于斯，昔仲尼，师项橐，古圣贤，尚勤学。" },
            { "bodytext": "赵中令，读鲁论，彼既仕，学且勤，披蒲编，削竹简。" },
            { "bodytext": "彼无书，且知勉，头悬梁，锥刺股，彼不教，自勤苦。" },
            { "bodytext": "如囊萤，如映雪，家虽贫，学不辍，如负薪，如挂角。" },
            { "bodytext": "身虽劳，犹苦卓，苏老泉，二十七，始发愤，读书籍。" },
            { "bodytext": "彼既老，犹悔迟，尔小生，宜早思，若梁灏，八十二。" },
            { "bodytext": "对大廷，魁多士，彼既成，众称异，尔小生，宜立志。" },
            { "bodytext": "莹八岁，能咏诗，泌七岁，能赋棋，彼颖悟，人称奇。" }
        ]
    },
    {
        "title": "三字经(八)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "尔幼学，当效之，蔡文姬，能辨琴，谢道韫，能咏吟。" },
            { "bodytext": "彼女子，且聪敏，尔男子，当自警，唐刘晏，方七岁。" },
            { "bodytext": "举神童，作正字，彼虽幼，身已仕，尔幼学，勉而致。" },
            { "bodytext": "有为者，亦若是，犬守夜，鸡司晨，苟不学，曷为人。" },
            { "bodytext": "蚕吐丝，蜂酿蜜，人不学，不如物，幼而学，壮而行。" },
            { "bodytext": "上致君，下泽民，扬名声，显父母，光于前，裕于后。" },
            { "bodytext": "人遗子，金满籯，我教子，惟一经，勤有功，戏无益。" },
            { "bodytext": "戒之哉，宜勉力。" }
        ]
    },
    {
        "title": "道德经(一-二)",
        "subtitle": "老子",
        "paragraph": [
            { "bodytext": "第一章" },
            { "bodytext": "道可道，非常道；名可名，非常名。" },
            { "bodytext": "无名天地之始，有名万物之母。" },
            { "bodytext": "故常无欲，以观其妙；常有欲，以观其徼。" },
            { "bodytext": "此两者同出而异名，同谓之玄，玄之又玄，众妙之门。" },
            { "bodytext": "第二章" },
            { "bodytext": "天下皆知美之为美，斯恶已；皆知善之为善，斯不善已。" },
            { "bodytext": "故有无相生，难易相成，长短相较，高下相倾，音声相和，前后相随。" },
            { "bodytext": "是以圣人处无为之事，行不言之教，万物作焉而不辞，生而不有，为而不恃，功成而弗居。" },
            { "bodytext": "夫唯弗居，是以不去。" }
        ]
    },
    {
        "title": "道德经(三-四)",
        "subtitle": "老子",
        "paragraph": [
            { "bodytext": "第三章" },
            { "bodytext": "尚贤，使民不争；不贵难得之货，使民不为盗；不见可欲，使民心不乱。" },
            { "bodytext": "无名天地之始，有名万物之母。" },
            { "bodytext": "是以圣人之治，虚其心，实其腹；弱其志，强其骨。" },
            { "bodytext": "为无为，则无不治。" },
            { "bodytext": "第四章" },
            { "bodytext": "道冲而用之或不盈，渊兮似万物之宗。" },
            { "bodytext": "挫其锐，解其纷，和其光，同其尘。" },
            { "bodytext": "湛兮似或存，吾不知谁之子，象帝之先。" }
        ]
    },
    {
        "title": "爱莲说",
        "subtitle": "(宋)周敦颐",
        "paragraph": [
            { "bodytext": "水陆草木之花，可爱者甚蕃。晋陶渊明独爱菊。自李唐来，世人甚爱牡丹。予独爱莲之出淤泥而不染，濯清涟而不妖，中通外直，不蔓不枝，香远益清，亭亭净植，可远观而不可亵玩焉。" },
            { "bodytext": "予谓菊，花之隐逸者也；牡丹，花之富贵者也；莲，花之君子者也。噫！菊之爱，陶后鲜有闻。莲之爱，同予者何人？牡丹之爱，宜乎众矣。" },
        ]
    },
    {
        "title": "陋室铭",
        "subtitle": "(唐)刘禹锡",
        "paragraph": [
            { "bodytext": "山不在高，有仙则名。水不在深，有龙则灵。斯是陋室，惟吾德馨。苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。可以调素琴，阅金经。无丝竹之乱耳，无案牍之劳形。南阳诸葛庐，西蜀子云亭。孔子云：何陋之有？" },
        ]
    },
    {
        "title": "诫子书",
        "subtitle": "(两汉)诸葛亮",
        "paragraph": [
            { "bodytext": "夫君子之行，静以修身，俭以养德。非淡泊无以明志，非宁静无以致远。夫学须静也，才须学也，非学无以广才，非志无以成学。淫慢则不能励精，险躁则不能治性。年与时驰，意与日去，遂成枯落，多不接世，悲守穷庐，将复何及！" }
        ]
    },
    {
        "title": "岳阳楼记",
        "subtitle": "范仲淹(宋)",
        "paragraph": [
            {"bodytext":"庆历四年春，滕子京谪守巴陵郡。越明年，政通人和，百废具兴，乃重修岳阳楼，增其旧制，刻唐贤今人诗赋于其上；属予作文以记之。"},
            {"bodytext":"予观夫巴陵胜状，在洞庭一湖。衔远山，吞长江，浩浩汤汤，横无际涯；朝晖夕阴，气象万千；此则岳阳楼之大观也，前人之述备矣。然则北通巫峡，南极潇湘，迁客骚人，多会于此，览物之情，得无异乎？"},
            {"bodytext":"若夫霪雨霏霏，连月不开；阴风怒号，浊浪排空；日星隐曜，山岳潜形；商旅不行，樯倾楫摧；薄暮冥冥，虎啸猿啼。登斯楼也，则有去国怀乡，忧谗畏讥，满目萧然，感极而悲者矣。"},
            {"bodytext":"至若春和景明，波澜不惊，上下天光，一碧万顷；沙鸥翔集，锦鳞游泳，岸芷汀兰，郁郁青青。而或长烟一空，皓月千里，浮光跃金，静影沉璧，渔歌互答，此乐何极。登斯楼也，则有心旷神怡，宠辱皆忘，把酒临风，其喜洋洋者矣。"},
            {"bodytext":"嗟夫！予尝求古仁人之心，或异二者之为，何哉？不以物喜，不以己悲，居庙堂之高则忧其民，处江湖之远则忧其君。是进亦忧，退亦忧。然则何时而乐耶？其必曰“先天下之忧而忧，后天下之乐而乐”乎！噫！微斯人，吾谁与归？"},
            {"bodytext":"时六年九月十五日。"}
        ]
    },
    {
        "title": "论求知",
        "subtitle": "培根(英国)",
        "paragraph": [
            {"bodytext":"求知可以作为消遣，可以作为装潢，也可以增长才干。"},
            {"bodytext":"当你孤独寂寞时，阅读可以消遣。当你高谈阔论时，知识可供装潢。当你处世行事时，求知可以促成才干。有实际经验的人虽然能办理个别性的事务，但若要综观整体，运筹全局，却唯有掌握理论知识方能办到。"},
            {"bodytext":"求知太慢会弛惰，为装潢而求知是欺人自欺，只会照书本条条办事会变成偏执的呆子。"},
            {"bodytext":"求知可以改进人的天性，而实验又可以改进知识本身。人的天性犹如野生的花草，求知学习好比修剪移栽。实习尝试则可检查修正知识本身的真伪。"},
            {"bodytext":"狡诈者轻鄙学问，愚鲁者羡慕学问，唯聪明者善于运用学问。知识本身并没有告诉人怎样运用它，运用的方法乃在书本之外。这是一门技艺，不经实验就不能学到。求知时不可专为挑剔辩驳去读书，但也不可轻易相信书本。求知的目的不是为了吹嘘炫耀，而是应该为了寻找真理、启迪智慧。"},
            {"bodytext":"有的知识只要浅尝即可，有的知识只要粗知即可，只有少数专门知识需要深入钻研、仔细揣摩。所以，有的书只读其中一部分即可，有的书只知其中梗概即可，而对于少数好书，则要精读、细读、反复地读。"},
            {"bodytext":"有的书可以请人代读，然后看他的笔记摘要就行了。但这只限于质量粗劣的书。否则一本好书将像已被蒸馏过的水，变得淡而乏味了!"},
            {"bodytext":"读书使人的头脑充实，讨论使人明辨是非，做笔记则能使知识准确。"},
            {"bodytext":"因此，如果一个人不愿做笔记，他的记忆力就必须强而可靠。如果一个人只愿孤独探索，他的头脑就必须格外锐利。如果有人不读书又想冒充博学多知，他就必定是一个狡黠的家伙。"},
            {"bodytext":"读史使人明智，读诗使人聪慧，演算使人精密，哲理使人深刻，伦理学使人有修养，逻辑修辞使人长于思辨。总之，知识能改变人的性格。"},
            {"bodytext":"不仅如此，精神上的各种缺陷，还都可以通过求知来改善。正如身体上的缺陷，可以通过运动来改善一样。例如打球有利于腰肾，射箭可扩胸利肺，散步则有助于消化，骑术使人反应敏捷，等等。同样，一个思维不集中的人，他可以研习数学。因为数学稍不仔细就会出错。缺乏分析判断力的人，他可以研习经院哲学，因为这门学问最讲究繁琐辩证。不善于推理的人，可以研习法律学。如此等等。这种头脑的缺陷，是都可以通过求知来治疗的。"}
            
        ]
    },
    {
        "title": "谈读书",
        "subtitle": "培根(英国)-王佐良译",
        "paragraph": [
            {"bodytext":"读书足以怡情，足以博彩，足以长才。"},
            {"bodytext":"其怡情也，最见于独处幽居之时；其博彩也，最见于高谈阔论之中；其长才也，最见于处世判事之际。练达之士虽能分别处理细事或判别枝节，然纵观统筹、全局策划，则舍好学深思者莫属。"},
            {"bodytext":"读书费时过多易惰，文采藻饰太盛则矫，全凭条文断事乃学究故态。读书补天然之不足，经验又补读书之不足，盖天生才干犹如自然花草，读书然后知如何修剪移接；而书中所示，如不以经验范之，则又大而无当。"},
            {"bodytext":"有一技之长鄙读书，无知者慕读书，唯明智之士用读书，然读书并不以用处告人，用书之智不在书中，而在书外，全凭观察得之。读书时不可存心诘难作者，不可尽信书上所言，亦不可只为寻章摘句，而应推敲细思。"},
            {"bodytext":"书有可浅尝者，有可吞食者，少数则须咀嚼消化。换言之，有只须读其部分者，有只须大体涉猎者，少数则须全读，读时须全神贯注，孜孜不倦。书亦可请人代读，取其所作摘要，但只限题材较次或价值不高者，否则书经提炼犹如水经蒸馏，淡而无味矣。"},
            {"bodytext":"读书使人充实，讨论使人机智，笔记使人准确。因此不常做笔记者须记忆特强，不常讨论者须天生聪颖，不常读书者须欺世有术，始能无知而显有知。"},
            {"bodytext":"读史使人明智，读诗使人灵秀，数学使人周密，科学使人深刻，论理学使人庄重，逻辑修辞之学使人善辩：凡有所学，皆成性格。"},
            {"bodytext":"人之才智但有滞碍，无不可读适当之书使之顺畅，一如身体百病，皆可借相宜之运动除之。滚球利睾肾，射箭利胸肺，慢步利肠胃，骑术利头脑，诸如此类。"},
            {"bodytext":"如智力不集中，可令读数学，盖演算须全神贯注，稍有分散即须重演；如不能辨异，可令读经院哲学，盖是辈皆吹毛求疵之人；如不善求同，不善以一物阐证另一物，可令读律师之案卷。如此头脑中凡有缺陷，皆有特药可医。"}
            
        ]
    }
]