var mainData = [
    {
        "title": "劝学(节选)",
        "subtitle": "(先秦)荀子",
        "paragraph": [
            { "bodytext": "君子曰：学不可以已。" },
            { "bodytext": "青，取之于蓝，而青于蓝；冰，水为之，而寒于水。木直中绳，輮以为轮，其曲中规。虽有槁暴，不复挺者，輮使之然也。故木受绳则直，金就砺则利，君子博学而日参省乎己，则知明而行无过矣。" },
            { "bodytext": "吾尝终日而思矣，不如须臾之所学也；吾尝跂而望矣，不如登高之博见也。登高而招，臂非加长也，而见者远；顺风而呼，声非加疾也，而闻者彰。假舆马者，非利足也，而致千里；假舟楫者，非能水也，而绝江河。君子生非异也，善假于物也。" },
            { "bodytext": "积土成山，风雨兴焉；积水成渊，蛟龙生焉；积善成德，而神明自得，圣心备焉。故不积跬步，无以至千里；不积小流，无以成江海。骐骥一跃，不能十步；驽马十驾，功在不舍。锲而舍之，朽木不折；锲而不舍，金石可镂。蚓无爪牙之利，筋骨之强，上食埃土，下饮黄泉，用心一也。蟹六跪而二螯，非蛇鳝之穴无可寄托者，用心躁也。" },
        ]
    },
    {
        "title": "三字经(一)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "人之初，性本善，性相近，习相远，苟不教，性乃迁。" },
            { "bodytext": "教之道，贵以专，昔孟母，择邻处，子不学，断机杼。" },
            { "bodytext": "窦燕山，有义方，教五子，名俱扬，养不教，父之过。" },
            { "bodytext": "教不严，师之惰，子不学，非所宜，幼不学，老何为。" },
            { "bodytext": "玉不琢，不成器，人不学，不知义，为人子，方少时。" },
            { "bodytext": "亲师友，习礼仪，香九龄，能温席，孝于亲，所当执。" },
            { "bodytext": "融四岁，能让梨，弟于长，宜先知，首孝弟，次见闻。" },
            { "bodytext": "知某数，识某文，一而十，十而百，百而千，千而万。" }
        ]
    },
    {
        "title": "三字经(二)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "三才者，天地人，三光者，日月星，三纲者，君臣义。" },
            { "bodytext": "父子亲，夫妇顺，曰春夏，曰秋冬，此四时，运不穷。" },
            { "bodytext": "曰南北，曰西东，此四方，应乎中，曰水火，木金土。" },
            { "bodytext": "此五行，本乎数，曰仁义，礼智信，此五常，不容紊。" },
            { "bodytext": "稻粱菽，麦黍稷，此六谷，人所食，马牛羊，鸡犬豕。" },
            { "bodytext": "此六畜，人所饲，曰喜怒，曰哀惧，爱恶欲，七情具。" },
            { "bodytext": "匏土革，木石金，丝与竹，乃八音，高曾祖，父而身。" },
            { "bodytext": "身而子，子而孙，自子孙，至玄曾，乃九族，人之伦。" }
        ]
    },
    {
        "title": "三字经(三)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "父子恩，夫妇从，兄则友，弟则恭，长幼序，友与朋。" },
            { "bodytext": "君则敬，臣则忠，此十义，人所同，凡训蒙，须讲究。" },
            { "bodytext": "详训诂，名句读，为学者，必有初，小学终，至四书。" },
            { "bodytext": "论语者，二十篇，群弟子，记善言，孟子者，七篇止。" },
            { "bodytext": "讲道德，说仁义，作中庸，乃孔伋，中不偏，庸不易。" },
            { "bodytext": "作大学，乃曾子，自修齐，至平治，孝经通，四书熟。" },
            { "bodytext": "如六经，始可读，诗书易，礼春秋，号六经，当讲求。" },
            { "bodytext": "有连山，有归藏，有周易，三易详，有典谟，有训诰。" }
        ]
    },
    {
        "title": "三字经(四)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "有誓命，书之奥，我周公，作周礼，著六官，存治体。" },
            { "bodytext": "大小戴，注礼记，述圣言，礼乐备，曰国风，曰雅颂。" },
            { "bodytext": "号四诗，当讽咏，诗既亡，春秋作，寓褒贬，别善恶。" },
            { "bodytext": "三传者，有公羊，有左氏，有谷梁，经既明，方读子。" },
            { "bodytext": "撮其要，记其事，五子者，有荀杨，文中子，及老庄。" },
            { "bodytext": "经子通，读诸史，考世系，知终始，自羲农，至黄帝。" },
            { "bodytext": "号三皇，居上世，唐有虞，号二帝，相揖逊，称盛世。" },
            { "bodytext": "夏有禹，商有汤，周文武，称三王，夏传子，家天下。" }
        ]
    },
    {
        "title": "三字经(五)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "四百载，迁夏社，汤伐夏，国号商，六百载，至纣亡。" },
            { "bodytext": "周武王，始诛纣，八百载，最长久，周辙东，王纲堕。" },
            { "bodytext": "逞干戈，尚游说，始春秋，终战国，五霸强，七雄出。" },
            { "bodytext": "嬴秦氏，始兼并，传二世，楚汉争，高祖兴，汉业建。" },
            { "bodytext": "至孝平，王莽篡，光武兴，为东汉，四百年，终于献。" },
            { "bodytext": "魏蜀吴，争汉鼎，号三国，迄两晋，宋齐继，梁陈承。" },
            { "bodytext": "为南朝，都金陵，北元魏，分东西，宇文周，与高齐。" },
            { "bodytext": "迨至隋，一土宇，不再传，失统绪，唐高祖，起义师。" }
        ]
    },
    {
        "title": "三字经(六)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "除隋乱，创国基，二十传，三百载，梁灭之，国乃改。" },
            { "bodytext": "梁唐晋，及汉周，称五代，皆有由，炎宋兴，受周禅。" },
            { "bodytext": "十八传，南北混，辽与金，皆称帝，元灭金，绝宋世。" },
            { "bodytext": "舆图广，超前代，九十年，国祚废，太祖兴，国大明。" },
            { "bodytext": "号洪武，都金陵，迨成祖，迁燕京，十六世，至崇祯。" },
            { "bodytext": "权阉肆，寇如林，李闯出，神器焚，清世祖，应景命。" },
            { "bodytext": "靖四方，克大定，古今史，全在兹，载治乱，知兴衰。" },
            { "bodytext": "读史书，考实录，通古今，若亲目，口而诵，心而惟。" }
        ]
    },
    {
        "title": "三字经(七)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "朝于斯，夕于斯，昔仲尼，师项橐，古圣贤，尚勤学。" },
            { "bodytext": "赵中令，读鲁论，彼既仕，学且勤，披蒲编，削竹简。" },
            { "bodytext": "彼无书，且知勉，头悬梁，锥刺股，彼不教，自勤苦。" },
            { "bodytext": "如囊萤，如映雪，家虽贫，学不辍，如负薪，如挂角。" },
            { "bodytext": "身虽劳，犹苦卓，苏老泉，二十七，始发愤，读书籍。" },
            { "bodytext": "彼既老，犹悔迟，尔小生，宜早思，若梁灏，八十二。" },
            { "bodytext": "对大廷，魁多士，彼既成，众称异，尔小生，宜立志。" },
            { "bodytext": "莹八岁，能咏诗，泌七岁，能赋棋，彼颖悟，人称奇。" }
        ]
    },
    {
        "title": "三字经(八)",
        "subtitle": "古圣人",
        "paragraph": [
            { "bodytext": "尔幼学，当效之，蔡文姬，能辨琴，谢道韫，能咏吟。" },
            { "bodytext": "彼女子，且聪敏，尔男子，当自警，唐刘晏，方七岁。" },
            { "bodytext": "举神童，作正字，彼虽幼，身已仕，尔幼学，勉而致。" },
            { "bodytext": "有为者，亦若是，犬守夜，鸡司晨，苟不学，曷为人。" },
            { "bodytext": "蚕吐丝，蜂酿蜜，人不学，不如物，幼而学，壮而行。" },
            { "bodytext": "上致君，下泽民，扬名声，显父母，光于前，裕于后。" },
            { "bodytext": "人遗子，金满籯，我教子，惟一经，勤有功，戏无益。" },
            { "bodytext": "戒之哉，宜勉力。" }
        ]
    },
    {
        "title": "道德经(一-二)",
        "subtitle": "老子",
        "paragraph": [
            { "bodytext": "第一章" },
            { "bodytext": "道可道，非常道；名可名，非常名。" },
            { "bodytext": "无名天地之始，有名万物之母。" },
            { "bodytext": "故常无欲，以观其妙；常有欲，以观其徼。" },
            { "bodytext": "此两者同出而异名，同谓之玄，玄之又玄，众妙之门。" },
            { "bodytext": "第二章" },
            { "bodytext": "天下皆知美之为美，斯恶已；皆知善之为善，斯不善已。" },
            { "bodytext": "故有无相生，难易相成，长短相较，高下相倾，音声相和，前后相随。" },
            { "bodytext": "是以圣人处无为之事，行不言之教，万物作焉而不辞，生而不有，为而不恃，功成而弗居。" },
            { "bodytext": "夫唯弗居，是以不去。" }
        ]
    },
    {
        "title": "道德经(三-四)",
        "subtitle": "老子",
        "paragraph": [
            { "bodytext": "第三章" },
            { "bodytext": "尚贤，使民不争；不贵难得之货，使民不为盗；不见可欲，使民心不乱。" },
            { "bodytext": "无名天地之始，有名万物之母。" },
            { "bodytext": "是以圣人之治，虚其心，实其腹；弱其志，强其骨。" },
            { "bodytext": "为无为，则无不治。" },
            { "bodytext": "第四章" },
            { "bodytext": "道冲而用之或不盈，渊兮似万物之宗。" },
            { "bodytext": "挫其锐，解其纷，和其光，同其尘。" },
            { "bodytext": "湛兮似或存，吾不知谁之子，象帝之先。" }
        ]
    },
    {
        "title": "爱莲说",
        "subtitle": "(宋)周敦颐",
        "paragraph": [
            { "bodytext": "水陆草木之花，可爱者甚蕃。晋陶渊明独爱菊。自李唐来，世人甚爱牡丹。予独爱莲之出淤泥而不染，濯清涟而不妖，中通外直，不蔓不枝，香远益清，亭亭净植，可远观而不可亵玩焉。" },
            { "bodytext": "予谓菊，花之隐逸者也；牡丹，花之富贵者也；莲，花之君子者也。噫！菊之爱，陶后鲜有闻。莲之爱，同予者何人？牡丹之爱，宜乎众矣。" },
        ]
    },
    {
        "title": "陋室铭",
        "subtitle": "(唐)刘禹锡",
        "paragraph": [
            { "bodytext": "山不在高，有仙则名。水不在深，有龙则灵。斯是陋室，惟吾德馨。苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。可以调素琴，阅金经。无丝竹之乱耳，无案牍之劳形。南阳诸葛庐，西蜀子云亭。孔子云：何陋之有？" },
        ]
    },
    {
        "title": "诫子书",
        "subtitle": "(两汉)诸葛亮",
        "paragraph": [
            { "bodytext": "夫君子之行，静以修身，俭以养德。非淡泊无以明志，非宁静无以致远。夫学须静也，才须学也，非学无以广才，非志无以成学。淫慢则不能励精，险躁则不能治性。年与时驰，意与日去，遂成枯落，多不接世，悲守穷庐，将复何及！" }
        ]
    }
]