var mainData = [
  {
    title: "P12L13_P14L4 瑜伽师菩提宝云",
    subtitle: "P12L13_P14L4",
    testdate: "19/04/2025",
    sentences: [
      "<b>大瑜伽师菩提宝云：「言悟入教授者，非说仅于量如掌许一小函卷而得定解，是说了解一切至言皆是教授。」又如大依怙之弟子修宝喇嘛云：「阿底峡之教授，于一座上，身语意三，碎为微尘。今乃了解一切经论皆是教授。」</b>",
      "大瑜伽师菩提宝曾说：「领悟佛陀的教法，并不是仅仅是对经文充分了解，而是体认到佛陀所有的一言一行都是在教育我们。」大依怙之弟子修宝喇嘛也说：「对于阿底峡尊者所教我的，透过每一次的修行，将身语意打碎成粉末、彻底摆脱。现在终于理解，原来一切教典，原来都是修行的方法。」",
      "<b>须如是知，如敦巴仁波卿云：「若曾学得众多法已，更须别求修法轨者，是为错谬。」虽经长时学众多法，然于修轨全未能知，若欲修法，诸更须从余求者，亦是未解如前说义而成过失。</b>",
      "必须要有这样的认知，就像敦巴仁波切说：「当广泛学习多种教法之后，还要另外去寻求其他的实修方法，这就错了。」虽然长时间学习各种教法，却对实修的法门一无所知，还要另外寻求修行的方法，这就是不了解上述的道理才导致这样的错误。",
      "<b>此中圣教，如《俱舍》云：「佛正法有二，以教证为体。」除其教、证二圣教外，别无圣教。教正法者，谓是抉择受持道理修行正轨；证正法者，谓是如其前抉择时，所抉择已而起修行。故彼二种，成为因果。</b>",
      "《俱舍论》说：「佛陀的正法有两种，就是教导与实证。」所谓的教导，就是让学习者能从众多法门中选择最适合自己的，而实证就是在抉择之后进行实修，因此两者是因果关系。",
      "<b>如跑马时，先示其马所应跑地，既示定已，应向彼跑。若所示地是此跑处而向余跑者，定成笑事。岂可闻思抉择此事，若修行时修行所余。</b>",
      "如同赛马时，先为马匹指示跑道，比赛时便应遵循路线。如果指定之后，马匹却往另外的方向跑去，便会成为笑话。同理可知:怎可以在决定修行方法之后，却又修习其他法门呢?",
      "<b>如是亦如《修次第后编》云：「复次，闻及思慧之所通达，即是修慧之所应修，非应修余。如示跑地，而应随跑。」</b>",
      "《修次第后编》也提到：「另外，通过听闻以及思考所了悟的法义，就是今后应当修持的内容，而不是另外学习其他法门，就如同赛马决定了赛道后就会遵循路线比赛。」",
      "<b>如是由此教授能摄一切经论道之枢要，于从亲近善知识法乃至止观，此一切中，诸应舍修者，即作舍修，诸应举修者，即以择慧而正思择，编为行持次第引导，故一切圣言皆现为教授。</b>",
      "如前所述，本论包含了所有经论中从亲近善知识到止观之间的所有重点。在这之中，当读到止住修的部分，便应该练习止住修；而当读到观察修的部分，便应该练习观察修。这种安排是为了能引导学习者体会出佛陀的每句话都是珍贵的教导。",
      "<b>若不尔者，于非圆满道体一分，离观察慧虽尽寿修，诸大经论非但不现为真教授，且于彼等，见唯开辟博大外解，而谤舍之。现见诸大经论之中所诠诸义，多分皆须以观察慧而正观择。</b>",
      "如果不依靠观察智慧修行，那就算你修一辈子，也无法在圆满的道上成就哪怕一点点。你虽然修了很久，但因为缺乏观察智慧，就算是经典和论典摆在面前，也不仅不会被你当作真正的教导，反而还会觉得只是空谈理论，不切实际，甚至还会轻视、诽谤它们。其实，从现在能看到的那些重要经典和论著中可以发现，里面所讲的大多数内容，都是需要依靠观察智慧去如理思维、辨别抉择的。",
      "<b>此复修时若弃舍者，则于彼等何能发生定解，见为最胜教授？此等若非最胜教授，谁能获得较造此等尤为殊胜教授论师？</b>",
      "如果在修行的时候把这些（指需要观察智慧抉择的经典义理）弃置不用，那又怎么可能对它们生起坚定的理解，认为它们是最殊胜的教导呢？如果连这些都不认为是最殊胜的教授，那谁还能写出比这些还更殊胜的教义呢？怎么可能还有比这些更厉害的论师呢？",
      "<b>如是若能将其深广契经及释现为教授，则其甚深续部及论诸大教典亦无少劳现为教授，则能发起执持彼等为胜教授所有定解，能尽遮遣妄执彼等非实教授，背弃正法诸邪分别罄无所余。</b>",
      "如果我们能够把那些内容深广的契经（佛经）和注释，直接当作修行的教授来看待，那么那些极深奥的密续经典和论典，也会不费多少力气地显现为修行的教授。这样一来，我们就能够生起坚定的理解，认为这些经典和论著确实是最殊胜的修行指导；同时，也能彻底断除那种认为它们不是实修法门的错误想法，把背离正法的一切错误分别念完全清除干净。"
    ]
  }
];
