{
    "category": "Classroom English 2024 (P3)",
    "title": "Practice 30 (07/04/2024)",
    "subtitle":"Practice 30",
    "testdate":"Completed on 07/04/2024",
    "words": [
        "existed",
        "bulged",
        "population",
        "wise",
        "Neanderthals",
        "often",
        "Someday",
        "gambled",
        "bank",
        "bills",
        "close",
        "",
        "strangers"
    ],
    "meanings": [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""         
    ],
    "meanings_cn": [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""            
    ],
    "pronunciation":[
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "sentences": [
        "Have you ever heard of the Neanderthals? What or who are they? Neanderthals existed about 150 000 years ago and were the first to wear clothes.",
        "They looked a lot like us except that their skulls bulged more at the back and they had receding chins, larger cheeks, and more pronounced eyebrow shape.",
        "They were also smaller and stockier and had heavier features. However, less than half the population reached the age of twenty.",
        "We, on the other hand, are called Homo sapiens, which means 'wise humans'. The first Homo sapien lived on earth about 100 000 years ago.",
        "Unlike the Neanderthals, we have smaller teeth, flat foreheads, straight faces, and rounded heads.",
        "Do you often take the lift instead of the stairs? If you seldom exercise, you should make an effort to climb the stairs more. It does wonders for your health.",
        "Someday, I am going to be a movie star. It is a wish I have had every day of my life! Somehow, I sense that it will never materialize but there is no harm in dreaming, is there?",
        "Lorna's father was a gambler. He gambled every day of his life. At one point in Lorna's life, her father was declared a bankrupt. They had to give up their luxury car and their semi-detached house.",
        "There was no money in the bank and nowhere to live. Lorna's mother tried to make ends meet by going out to work but because she was not highly educated, she earned only six hundred dollars a month.",
        "That was hardly enough to pay the bills and put food on the table. Lorna's grandmother agreed to take care of her. She would put Lorna through school with the money Grandpa has left her when he passed on.",
        "Lorna was extremely close to her grandmother. They had come to depend on each other. When her grandmother passed away, she was only sixteen.",
        "Lorna was too young to live by herself so she went home to stay with her parents. They were no longer close.",
        "In fact, she felt like she was living with strangers. Lorna and her parents hardly communicated and this sent Lorna into depression."
    ]
}