{
  "category": "English Spelling 2025",
  "title": "Unit 3 - The Paralympic Games",
  "subtitle": "Unit 3",
  "testdate": "Test Date 17/02/2025",
  "words": [
    "Athletes",
    "sport",
    "visually impaired",
    "score",
    "challenges",
    "opponents",
    "medals",
    "spectators",
    "represent",
    "compete",
    "rules",
    "cheering",
    "referee",
    "goals",
    "participate",
    "organise",
    "backstroke",
    "train",
    "strategy",
    "world record"
  ],
  "meanings": [
    "People who take part in competitive sporting events",
    "activity that you do for pleasure and that needs physical effort or skill",
    "having severely weakened eyesight",
    "to win points in a game",
    "a new or difficult task that tests somebody's ability and skill",
    "people who compete with others in a contest or game",
    "flat piece of metal, usually like a coin in shape, that is given to the winner of a competition",
    "people who watch a show, game or event",
    "to be a member of a group and act or speak for them at an event, a meeting",
    "to take part in a contest or game",
    "a statement of what may, must or must not be done in a particular",
    "loud shouting to support or encourage someone",
    "the official who controls the game in some sports",
    "the act of kicking or hitting the ball into the goal post to score a point",
    "to take part in or become involved in an activity",
    "to make all the arrangements for something to happen",
    "a style of swimming performed on the back",
    "to teach a person or an animal the skills for a particular job or activity",
    "a plan that is intended to achieve a particular purpose",
    "recognised as the best anywhere in the world"
  ],
  "meanings_cn": [
    "运动员",
    "运动",
    "视力受损",
    "得分",
    "挑战",
    "对手",
    "奖牌",
    "观众",
    "代表",
    "竞争",
    "规则",
    "欢呼",
    "裁判",
    "目标",
    "参与",
    "组织",
    "仰泳",
    "训练",
    "策略",
    "世界纪录"
  ],
  "pronunciation": [
    "/ˈæθliːts/",
    "/spɔːrt/",
    "/ˈvɪʒuəli ɪmˈpɛrd/",
    "/skɔːr/",
    "/ˈtʃælɪndʒɪz/",
    "/əˈpəʊnənts/",
    "/ˈmɛdəlz/",
    "/spɛkˈteɪtərz/",
    "/ˌrɛprɪˈzɛnt/",
    "/kəmˈpiːt/",
    "/ruːlz/",
    "/ˈtʃɪərɪŋ/",
    "/ˌrɛfəˈriː/",
    "/ɡəʊlz/",
    "/pɑːrˈtɪsɪpeɪt/",
    "/ˈɔːrɡənaɪz/",
    "/ˈbækstroʊk/",
    "/treɪn/",
    "/ˈstrætədʒi/",
    "/wɜːrld ˈrɛkɔːrd/"
  ],
  "sentences": [
    "Athletes from around the world will be competing at the Olympics.",
    "Soccer is my favourite sport.",
    "Hannah is able to walk to school although she is visually impaired.",
    "Ronaldo managed to score a goal in the second half of the match.",
    "She faced many challenges before becoming a well-known artist.",
    "The team's opponents are unbeatable this season.",
    "He worked hard to win several medals in the Olympics.",
    "The spectators cheered for their favourite team during the competition.",
    "The athletes carry the flag that represents that their country.",
    "He is hoping to compete in the upcoming marathon.",
    "The players have to follow the rules during the game.",
    "The spectators were cheering and clapping loudly for their favourite player.",
    "The referee issued the player a yellow card for breaking the rules.",
    "Ray scored the most goals during the soccer match.",
    "She did not participate in the class discussion.",
    "Mrs Lim helped to organise the various events for the students.",
    "John won the 100m backstroke at the swimming carnival.",
    "The coaches train him to do well in the competition.",
    "We need to come up with a strategy to win the match.",
    "He broke the world record for the 100m race."
  ]
}
