{
    "category": "English Spelling 2024",
    "title": "Unit 1 - Fearless Phil",
    "subtitle":"Unit 1",
    "testdate":"Test Date 18/01/2024",
    "words": [
        "shiver",
        "rumbled",
        "grumbled",
        "snarling",
        "stumbled",
        "quivered",
        "trembled",
        "bolted",
        "perched",
        "towering",
        "invincible",
        "fearless",
        "cunning",
        "threatening",
        "encouragement",
        "stomach",
        "jacket",
        "swooped down",
        "menacing growl",
        "mountain track"
    ],
    "meanings": [
        "to shake slightly because one feels cold, ill, or frightened",
        "a continuous low sound",
        "to complain about someone or something in an annoyed way",
        "to make a deep, rough sound while showing the teeth, usually in anger or to speak",
        "to hit your foot against something while walking and almost fall",
        "to shake slightly",
        "to shake slightly in a way that you cannot control, for example because you are frightened, angry, or excited",
        "to move very fast, especially as a result of being frightened",
        "to rest on a branch or other object, to sit or be on the edge or top of something",
        "very high or very tall",
        "impossible to defeat",
        "brave, not afraid of anything",
        "being clever something to get what you want, especially by tricking other people",
        "expressing the possibility that something unwanted or unpleasant will happen",
        "words or behaviour that give someone confidence to do something",
        "an organ in the body where food is digested",
        "a short coat",
        "to move very quickly and easily through the air, down from a high position in order to attack",
        "a low, rough sound, usually in anger",
        "a path that is narrower than a road, often with an uneven surface"            
    ],
    "meanings_cn": [
        "发抖, 打颤",
        "咕噜声, 隆隆声",
        "抱怨, 咕哝",
        "咆哮, 咆哮着说",
        "绊倒, 跌倒",
        "颤抖, 哆嗦",
        "颤抖, 发抖",
        "突然逃跑, 猛冲",
        "栖息, 停栖",
        "高耸, 巍峨",
        "无敌的",
        "无畏的, 勇敢的",
        "狡猾, 狡诈",
        "威胁的, 具有威胁性的",
        "鼓励, 激励",
        "胃",
        "夹克, 外套",
        "俯冲, 猛扑下来",
        "威胁性的咆哮声",
        "山间小路, 山路"            
    ],
    "pronunciation":[
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "sentences": [
        "The weird sounds made us shiver with fear as we walked.",
        "His stomach rumbled loudly as he had not taken his breakfast.",
        "Marvin grumbled that he had a lot of homework to do during the holidays.",
        "The dog was baring its teeth and snarling at another dog that stole its food.",
        "The hunter fell down when his feet stumbled on a log.",
        "She quivered at the thought of being left alone in the jungle.",
        "The little girl trembled with fear when she heard a strange knock on her door.",
        "He bolted down the stairs when he heard the doorbell ring.",
        "The bird flew and perched on a branch high up on a tree.",
        "James is so tall that he is towering over his peers in class.",
        "He was an invincible warrior whom no one could defeat.",
        "Wu Song was a fearless man who fought and killed a tiger with his bare hands.",
        "Henry is cunning and knows what to say or do to get his way.",
        "The clouds look threatening, signalling that a thunderstorm is coming soon.",
        "Mary's parents gave her some words of encouragement before she went for her examination.",
        "Tommy must be hungry because his stomach has started growling.",
        "As the weather was very cold, Simon put on a jacket before going out.",
        "Alan shrieked when the flying insect swooped down in front of him",
        "The dog gave a menacing growl as the thief tried to enter the house.",
        "Many travellers used the mountain track to get to the top of the mountain."
    ]
}