{
  "category": "English Spelling 2025",
  "title": "Unit 5 - Ruby's Sunflower",
  "subtitle": "Unit 5",
  "testdate": "Test Date 25/04/2025",
  "words": [
    "contest",
    "measure",
    "judge",
    "crossly",
    "swimming",
    "lead",
    "special",
    "fetch",
    "slip",
    "practise",
    "straight",
    "snap",
    "scramble",
    "surprised",
    "whisper",
    "delight",
    "beat",
    "badge",
    "gardening",
    "stare"
  ],
  "meanings": [
    "competition; an event in which people compete for prizes",
    "to find out the exact size or amount of something",
    "the person who decides who is the winner of a competition",
    "in an angry manner",
    "the activity of moving through water by moving the body",
    "a winning position in a competition",
    "different from ordinary",
    "to go to another place to bring something or someone back",
    "to move out of position of someone's grasp",
    "to do something regularly in order to be good at it",
    "something that is not curved or bent",
    "to break suddenly and completely, usually with a sharp cracking sound",
    "to move quickly or climb quickly but with difficulty",
    "caught off guard by something unexpected",
    "to speak very softly so that only the person close to you can hear",
    "great satisfaction or happiness",
    "to do better than",
    "a piece of metal or plastic object with words or picture on it, that you fasten on your clothing to show people who you are",
    "an activity of taking care of plants",
    "to look for a long time with eyes wide open"
  ],
  "meanings_cn": [
    "比赛；竞赛",
    "测量；衡量",
    "评判；法官",
    "生气地；不耐烦地",
    "游泳",
    "带领；引导",
    "特别的；特殊的",
    "取来；拿来",
    "滑倒；滑动",
    "练习；实习",
    "笔直的",
    "猛地折断；啪的一声",
    "争抢；爬行；混乱",
    "惊讶的",
    "耳语",
    "高兴；欣喜",
    "打败；跳动",
    "徽章",
    "园艺",
    "凝视"
  ],
  "pronunciation": [
    "/ˈkɒntest/",
    "/ˈmeʒər/",
    "/dʒʌdʒ/",
    "/ˈkrɒsli/",
    "/ˈswɪmɪŋ/",
    "/liːd/",
    "/ˈspɛʃl/",
    "/fetʃ/",
    "/slɪp/",
    "/ˈpræktɪs/",
    "/streɪt/",
    "/snæp/",
    "/ˈskræmbl/",
    "/sərˈpraɪzd/",
    "/ˈwɪspər/",
    "/dɪˈlaɪt/",
    "/biːt/",
    "/bædʒ/",
    "/ˈɡɑːdnɪŋ/",
    "/ster/"
  ],
  "sentences": [
    "My brother is confident in winning the talent contest.",
    "I used a weighing scale to measure my weight.",
    "The principal is the judge for the story-telling competition.",
    "The Discipline Master looked crossly at the latecomers.",
    "I went swimming with my friends.",
    "He was in the lead of the race from the start.",
    "My parents told me to dress up for this special occasion.",
    "My grandparents fetch me from school every day.",
    "My clumsiness caused the mug to slip off my hand.",
    "My instructor told us to practise dribbling basketball daily.",
    "The road ahead is a straight path to our destination.",
    "Bending a ruler too far will cause it to snap.",
    "The monkey used all its might to scramble up the tree when a wild boar came over.",
    "I was surprised to receive so many gifts on my birthday.",
    "We can only whisper in the library if we need to talk.",
    "Saul punched the air with delight when he heard that he was the winner.",
    "Our opponents beat us fair and square and we admitted defeat.",
    "The prefects wear their badge proudly on their uniform every day.",
    "My grandfather who has green fingers enjoys gardening.",
    "Mother always reminds us not to stare at people as it is rude."
  ]
}
