{
    "category": "English Spelling 2024",
    "title": "Unit 4 - Predators And Prey",
    "subtitle":"Unit 4",
    "testdate":"Test Date 28/03/2024",
    "words": [
	"forage",
	"survive",
	"escape",
	"camouflage",
	"stalk",
	"grunt",
	"resemble",
	"illegal",
	"endangered",
	"tactics",
	"trait",
	"threat",
	"predators",
	"otters",
	"quills",
	"talons",
	"fangs",
	"habitat",
	"shelter",
	"fishermen"
    ],
    "meanings": [
	"to search widely for food",
	"to continue to live or exist",
	"to get away from a place where you were not allowed to leave",
	"(of an animal or plant) to have a colour or shape that makes it appear to mix with its natural environment so that it cannot be seen or attacked",
	"to move slowly and quietly towards an animal or a person, in order to kill, catch or harm it or them",
	"(of a person) to make a short, low sound instead of speaking, usually because of anger or pain",
	"to look like another person or thing",
	"not allowed by law",
	"animals or plants that may soon not exist because there are very few now alive.",
	"methods you use to achieve something",
	"a particular characteristic that can produce a particular type of behaviour",
	"a person or thing likely to cause damage or danger.",
	"animals that kill and eat other animals",
	"mammals with four legs and short brown fur that swim well and eat fish",
	"any of the long sharp pointed hairs on the body of a porcupine",
	"sharp nails on the feet of a bird that it uses when hunting animals",
	"long, sharp teeth that animals such as snakes and dogs have",
	"the natural environment in which an animal or plant usually lives",
	"a place to give protection from bad weather, danger, or attack",
	"people who catch fish for a living"
    ],
    "meanings_cn": [
	"觅食",
	"幸存",
	"逃脱",
	"伪装",
	"潜行",
	"咕噜声",
	"类似",
	"非法的",
	"濒危的",
	"战术",
	"特征",
	"威胁",
	"捕食者",
	"水獭",
	"刺",
	"爪",
	"獠牙",
	"栖息地",
	"庇护所",
	"渔民"           
    ],
    "pronunciation":[
	"/fɔːrɪdʒ/",
	"/səˈvaɪv/",
	"/ɪˈskeɪp/",
	"/ˈkæməflɑːʒ/",
	"/stɔːk/",
	"/ɡrʌnt/",
	"/rɪˈzembl/",
	"/ˈɪlɪɡəl/",
	"/ɪnˈdeɪndʒəd/",
	"/ˈtæktɪks/",
	"/treɪt/",
	"/θret/",
	"/ˈprɛdətərz/",
	"/ˈɒtərz/",
	"/kwɪlz/",
	"/ˈtælənz/",
	"/fæŋz/",
	"/ˈhæbɪtæt/",
	"/ˈʃɛltər/",
	"/ˈfɪʃəmən/"
    ],
    "sentences": [
	"The animals forage for food in the woods.",
	"Living things need air, food, and water to survive.",
	"The mouse struggled to escape the trap that it was caught in.",
	"The hare's white fur helps it camouflage with its snowy surroundings.",
	"Lions stalk their prey as a team before launching an attack.",
	"The boys grunt loudly when they are working as they are tired and hungry.",
	"The tiger has stripes that resemble shadows of the forest.",
	"Some animals may soon become extinct due to man's illegal hunting.",
	"The wild tiger is considered critically endangered.",
	"Jason tried to think of different tactics to beat his sister at a game of chess.",
	"Kindness is her best trait, making her well-liked by her peers.",
	"Large pythons are a threat to orangutans.",
	"Predators are animals that hunt and kill other animals for food.",
	"Henry spotted a family of otters swimming along the river.",
	"The quills on a porcupine may drop off when it shakes its body.",
	"The eagle dug its sharp talons into its prey and then flew up to the sky.",
	"The snake sank its fangs into its victim.",
	"Due to deforestation, many animals are losing their natural habitat.",
	"As soon as they heard thunder, the group of scouts quickly looked for shelter.",
	"The fishermen mend the holes in their nets to ensure that they get the most catch when they go out to sea."
    ]
}