{
    "category": "English Spelling 2024",
    "title": "Unit 7 - There's A Boy Under The Bed",
    "subtitle":"Unit 7",
    "testdate":"Test Date 12/07/2024",
    "words":["croaked","flopped","disqualified","transferred","gestured","taunt","icky","scrawny","curious","unfamiliar","bespectacled","sheepishly","effort","pause","banter","commotion","dessert","sardine","liquorice","marshmallow"],
	"meanings":["to speak with a deep, rough voice","to fall or drop heavily","to stop someone from being in a competition or doing something because they are unsuitable, or they have done something wrong","to move from one place, person, or position to another, or to cause someone or something to move","a movement of the hands, arms, or head, etc. to express an idea or feeling","to purposely annoy and upset someone by making unkind remarks to them or laughing unkindly at them","unpleasant or disgusting","very thin because not fed enough","interested in learning about people or things around you","not previously experienced or known","wearing glasses","in a way that is embarrassed because you have done something wrong, silly or a lack of self-confidence","an attempt to do something that is difficult or that involves hard work","a short period in which something such as a sound or an activity is stopped before starting again","conversation that is funny and not serious","a sudden, short period of noise, confusion, or excited movement","sweet food eaten at the end of a meal","a small, edible fish, often packed in large numbers in flat metal containers","a black sweet with a strong flavour","a soft, often white, candy made mainly of sugar"],
	"meanings_cn":["呱呱叫","扑通倒下","被取消资格","转移","做手势","嘲笑","恶心","瘦弱","好奇","不熟悉","戴眼镜的","羞怯地","努力","暂停","玩笑","喧闹","甜点","沙丁鱼","甘草","棉花糖"],
	"pronunciation":["/krəʊkt/","/flɒpt/","/dɪsˈkwɒlɪfaɪd/","/trænsˈfɜːd/","/ˈdʒɛstʃəd/","/tɔːnt/","/ˈɪki/","/ˈskrɔːni/","/ˈkjʊəriəs/","/ˌʌnfəˈmɪliər/","/bɪˈspɛktəkld/","/ˈʃiːpɪʃli/","/ˈɛfət/","/pɔːz/","/ˈbæntər/","/kəˈməʊʃən/","/dɪˈzɜːt/","/sɑːˈdiːn/","/ˈlɪkərɪs/","/ˈmɑːrʃˌmæloʊ/"],
    "sentences":["He croaked when he spoke as he had a sore throat.","James was so tired that he flopped onto his bed the moment he reached home.","Ben was disqualified from the competition for cheating.","I studied for two years at Sunshine Primary School, then transferred to Kingsley Primary School.","The ushers gestured to the audience to remain seated in their seats.","The other kids used to taunt him at the playground because he was fat and wore glasses.","He quickly wiped the icky smear off his hand with a tissue paper.","The homeless boy looked scrawny as he had not eaten for a few days.","Babies are curious about everything around them.","The man seems unfamiliar to her as she has never met him before.","Tom introduced the bespectacled boy to all of us.","He admitted sheepishly he had not done his project.","My father makes an effort to wake up half an hour earlier every day to drive me to school.","There was a pause before he answered the students' questions.","Friendly banter is encouraged to create positive relationships.","There was a commotion outside the classroom when the students returned from recess.","My favourite dessert to have after a meal is ice cream.","Mother packed some sardine sandwiches for her snack time.","Not everyone likes to eat liquorice as it has a unique flavour.","It is safe to give marshmallow to the child because it is a soft candy."]
}