{
    "category": "English Spelling 2024",
    "title": "Unit 8 - Prince Zak And The Wise Frog",
    "subtitle":"Unit 8",
    "testdate":"Test Date 12/09/2024",
    "words":["honour","contain","misbehave","peered","desired","snatched","hollow","filthy","murky","obvious","magnificent","willing","keenly","boldly","warily","sternly","uncontrollably","disguise","success","appreciation"],
	"meanings":["to do what you promised or agreed to do","to control or hide a strong emotion, such as excitement or anger","to behave with poor manners or a lack of courtesy","to look carefully or with difficulty","to want something, especially strongly","to take something away suddenly and roughly","having a hole or empty space inside","extremely or unpleasantly dirty","dark and dirty or difficult to see through","easy to see, recognise, or understand","very good, beautiful, or deserving to be admired","to be happy, ready or eager to do something","to watch very closely, and notice every detail","in a brave and confident way, without showing any fear","in a way that shows a lack of trust; suspiciously","in a way that shows disapproval","too strong or violent to be controlled","something that someone wears to hide their true appearance","the achieving of desired results, or someone or something that achieves positive results","showing that you are grateful for something that person has done"],
	"meanings_cn":["荣誉","包含","行为不端","凝视","渴望","抢夺","空的","肮脏的","昏暗的","明显的","壮丽的","愿意的","热切地","大胆地","警惕地","严厉地","无法控制地","伪装","成功","感激"],
	"pronunciation":["/ˈɒnər/","/kənˈteɪn/","/ˌmɪsbɪˈheɪv/","/pɪərd/","/dɪˈzaɪərd/","/snætʃt/","/ˈhɒləʊ/","/ˈfɪlθi/","/ˈmɜːki/","/ˈɒbvɪəs/","/mæɡˈnɪfɪsənt/","/ˈwɪlɪŋ/","/ˈkiːnli/","/ˈbəʊldli/","/ˈweərɪli/","/ˈstɜːnli/","/ˌʌnkənˈtrəʊləbli/","/dɪsˈɡaɪz/","/səkˈsɛs/","/əˌpriːʃiˈeɪʃən/"],
    "sentences":["She must honour her promise to him and return the money she borrowed.","She could no longer contain her anger and started yelling at him.","There will always be some children who misbehave at the playground.","When no one answered the door, she peered through the window to see if anyone was there.","Karen finally received the book that she had desired.","The little boy cried when his sister snatched his toy away from him.","If you tap on the wall, you can hear it is hollow behind.","Hannah washed her filthy hands after playing with mud.","The river was brown and murky after the storm.","It is obvious that he does not like dogs as he walks away when my dog goes near him.","The view from the top of the mountain is magnificent.","I am willing to help you if you want me to.","He observed keenly how the baker kneaded the dough.","The soldiers fought boldly when their enemies attacked them.","She eyed the cat warily as she was afraid that it might pounce on her.","The teacher sternly told the students to keep their volume down.","Lucy sobbed uncontrollably when she lost her favourite pen.","The thief put on a disguise as he hoped that no one would recognise him.","The concert was a success and received many positive reviews.","These flowers are a token of my appreciation for all your help."]
}