{
  "category": "English Spelling 2025",
  "title": "Unit 6 - Dinosaurs Exist!",
  "subtitle": "Unit 6",
  "testdate": "Test Date 19/05/2025",
  "words": [
    "expedition",
    "repellent",
    "average",
    "disappear",
    "adventurous",
    "choking",
    "vivid",
    "imagination",
    "deceiving",
    "creatures",
    "fantasies",
    "enormous",
    "extinct",
    "reluctantly",
    "dusky",
    "convincing",
    "snarling",
    "brute",
    "blood-curdling",
    "reptilian"
  ],
  "meanings_cn": [
    "远征；探险",
    "驱虫剂；令人反感的",
    "平均的；普通的",
    "消失",
    "富有冒险精神的",
    "令人窒息的；哽咽的",
    "生动的；清晰的",
    "想象力",
    "欺骗的",
    "生物；怪物",
    "幻想；梦境",
    "巨大的",
    "灭绝的",
    "不情愿地",
    "昏暗的；微暗的",
    "令人信服的",
    "咆哮的",
    "野兽；粗暴的人",
    "令人毛骨悚然的",
    "爬行动物似的"
  ],
  "pronunciation": [
    "/ˌekspəˈdɪʃən/",
    "/rɪˈpelənt/",
    "/ˈævərɪdʒ/",
    "/ˌdɪsəˈpɪə(r)/",
    "/ədˈventʃərəs/",
    "/ˈtʃəʊkɪŋ/",
    "/ˈvɪvɪd/",
    "/ɪˌmædʒɪˈneɪʃən/",
    "/dɪˈsiːvɪŋ/",
    "/ˈkriːtʃəz/",
    "/ˈfæntəsiz/",
    "/ɪˈnɔːməs/",
    "/ɪkˈstɪŋkt/",
    "/rɪˈlʌktəntli/",
    "/ˈdʌski/",
    "/kənˈvɪnsɪŋ/",
    "/ˈsnɑːlɪŋ/",
    "/bruːt/",
    "/ˈblʌdˌkɜːdlɪŋ/",
    "/rɛpˈtɪliən/"
  ],
  "meanings": [
    "an excursion, journey, or voyage made for some specific purpose",
    "medicine or a substance that keeps insects away",
    "If you need to find the average of a set of numbers, you add them all together and divide by the amount of numbers.",
    "If people or things disappear, they go some where where they cannot be seen or found",
    "willing to try new or difficult things",
    "you stop breathing becausesomethingis blocking your throat",
    "produce very clear, powerful and detailed images in the mind",
    "the ability to form pictures in the mind",
    "to persuade someone that something false is the truth",
    "any large or small living thing that can move independently",
    "a pleasant situation that you enjoy thinking about but is unlikely to happen",
    "extremely large",
    "no longer existing",
    "in a way that shows that you are not willing to do something and are therefore slow to do it",
    "dark in colour",
    "able to make you believe that something is true or right:",
    "to make a deep, rough sound while showing the teeth, usually in anger",
    "great physical force or strength",
    "causing a feeling of extreme fear",
    "used to describe an unpleasantly strange and unfriendly person or type of behaviour"
  ],
  "sentences": [
    "The group of climbers began their expedition up the mountain.",
    "The students were reminded to apply the insect repellent before stepping outdoors.",
    "The average temperature in Singapore is usually between 25 degrees Celsius and 31 degrees Celsius.",
    "Mother suspected the dog when her items started to disappear.",
    "Being adventurous, Sam decided to try bungee jumping.",
    "Jack was choking on a fish bone and his mother had to help him.",
    "The description of the place was so vivid that we could picture how it looked like.",
    "The story captured the imagination of the readers.",
    "The company was deceiving the customers by selling old items at a high price.",
    "The jungle is a home to many creatures.",
    "He likes reading and he is into fantasies.",
    "He was frightened when he saw an enormous rat run across the road.",
    "There is a concern that the giant panda wil become extinct soon.",
    "John followed what his mother told him reluctantly as he was tired.",
    "In autumn, the leaves turn dusky red.",
    "He was punished as he could not give a convincing account of what had happened.",
    "The dogs started snarling at each other and I had to separate them.",
    "The police had to use brute force on the robber.",
    "The blood-curdling story sent shivers down her spine.",
    "The kidnapper's reptilian gaze frightened me."
  ]
}
