{
    "category": "English Spelling 2024",
    "title": "Unit 3 - Camille And The Sunflowers",
    "subtitle":"Unit 3",
    "testdate":"Test Date 23/02/2024",
    "words": [
        "teased",
        "hurled",
        "beamed",
        "sprinted",
        "withered",
        "billowing",
        "strange",
        "delicious",
        "confusion",
        "techniques",
        "opportunity",
        "furniture",
        "canvas",
        "exhibits",
        "paintings",
        "photograph",
        "galleries",
        "museums",
        "grown-ups",
        "slipped out"
    ],
    "meanings": [
        "to laugh at someone or say unkind things about them, either because you are joking or because you want to upset that person",
        "to throw something with a lot of force, usually in an angry or violent way",
        "to smile with obvious pleasure",
        "to run as fast as you can over a short distance",
        "dry and decaying",
        "moving mass of something, such as smoke or cloud, spreading over a large area",
        "not known or familiar",
        "having a very pleasant taste or smell",
        "a situation, often with a lot of activity and noise, in which people do not know what to do",
        "ways of doing an activity that needs skill",
        "chance to do something",
        "things such as chairs, tables and beds that are used in a home or office",
        "a piece of strong, coarse cloth used by artists for painting on, usually with oil paints",
        "objects that are shown to the public in places such as museums",
        "a picture created by putting paint on a surface",
        "a picture produced using camera",
        "rooms or buildings that are used for showing works of art",
        "buildings where people can go to view works of art or objects of interest to science or history",
        "an adult, used especially when talking to children",
        "to leave quietly or quickly so that no one will notice"    
    ],
    "meanings_cn": [
        "取笑",
        "抛掷",
        "发光",
        "冲刺",
        "凋零",
        "翻滚",
        "奇怪的",
        "美味的",
        "混乱",
        "技术",
        "机会",
        "家具",
        "画布",
        "展品",
        "画作",
        "照片",
        "画廊",
        "博物馆",
        "成年人",
        "溜走"           
    ],
    "pronunciation":[
        "/tiːzd/",
        "/hɜːrld/",
        "/biːmd/",
        "/ˈsprɪntɪd/",
        "/ˈwɪðərd/",
        "/ˈbɪloʊɪŋ/",
        "/streɪndʒ/",
        "/dɪˈlɪʃəs/",
        "/kənˈfjuːʒən/",
        "/tɛkˈniːks/",
        "/ˌɑpərˈtunəti/",
        "/ˈfɜːrnɪtʃər/",
        "/ˈkænvəs/",
        "/ɪɡˈzɪbɪts/",
        "/ˈpeɪntɪŋz/",
        "/ˈfoʊtəɡræf/",
        "/ˈɡæləriz/",
        "/mjuˈziːəmz/",
        "/ɡroʊn ʌps/",
        "/slɪpt aʊt/"
    ],
    "sentences": [
        "Bobby teased his sister to irritate her.",
        "He was so angry that he hurled the book at his brother.",
        "Mary beamed at the principal as she received the prize.",
        "The boy sprinted to the bus stop to catch the bus that was about to leave.",
        "The flowers withered as they were not watered for a few days.",
        "There was smoke billowing out of the burning building.",
        "With so many strange faces around her, the baby started to cry.",
        "The cake that my mother baked for my birthday is delicious.",
        "In the midst of the confusion after the fire, Ali got separated from his parents.",
        "Sam went for a course to learn some techniques in making clay objects by hand.",
        "She was grateful for having been given the opportunity to perform on stage in front of a large audience.",
        "Mr Tan decided to change the furniture in his house for Chinese New Year.",
        "Many people gathered around the well-known painter when he started painting on a canvas.",
        "The museum has a fascinating collection of exhibits ranging from pottery to clothings.",
        "Vincent Van Gogh's paintings have captured the minds and hearts of millions of art lovers.",
        "Rhonda likes to have her photograph taken with her friends.",
        "The art galleries are always fully packed with students viewing the paintings.",
        "He is a well-travelled man who has been to many museums around the world.",
        "This book is suitable for grown-ups but not children to read.",
        "Camille slipped out through the back door and ran down the street."   
    ]
}