{
  "category": "English Spelling 2025",
  "title": "P4 Vocabulary (1)",
  "subtitle": "P4 Vocabulary 1",
  "testdate": "28/02/2025",
  "words": [
    "anxious",
    "amusing",
    "envy",
    "nervously",
    "whispered",
    "ignored",
    "warned",
    "embarrassed",
    "ransacked",
    "envious",
    "disgusting",
    "bruised",
    "stroll",
    "recovered",
    "engrossed",
    "cried",
    "graze",
    "white",
    "trip",
    "inconsiderate"
  ],
  "meanings": [
    "It describes parents who are worried or concerned about their children's performance in the upcoming exams.",
    "funny or entertaining",
    "feeling very jealous of someone else's possessions or success",
    "the speaker would likely feel anxious or uneasy after breaking something important to their mother",
    "speaking in a soft, quiet voice",
    "deliberately not pay attention to someone",
    "giving a cautionary message about potential danger",
    "feeling ashamed or awkward in a socially uncomfortable situation",
    "search a place thoroughly and violently",
    "feeling jealous of someone else's possessions or good fortune",
    "something that causes a strong feeling of dislike or revulsion",
    "to cause injury to the skin, resulting in discoloration",
    "a leisurely walk",
    "to regain strength or health after an illness or rest",
    "being completely absorbed or involved in something",
    "it indicates expressing pain or distress",
    "to feed on grass or other vegetation",
    "to describe someone's face when they are shocked, frightened, or scared",
    "a short journey, especially for educational purposes like a field trip",
    "lacking concern for the feelings or needs of others"
  ],
  "meanings_cn": [
    "焦虑的",
    "有趣的",
    "嫉妒",
    "紧张地",
    "低语",
    "忽视",
    "警告",
    "尴尬的",
    "洗劫",
    "羡慕的",
    "令人作呕的",
    "瘀伤的",
    "漫步",
    "恢复",
    "全神贯注的",
    "哭泣",
    "擦伤",
    "白色",
    "绊倒",
    "不顾他人的"
  ],
  "pronunciation": [
    "/ˈæŋkʃəs/",
    "/əˈmjuːzɪŋ/",
    "/ˈɛnvi/",
    "/ˈnɜːrvəsli/",
    "/ˈwɪspərd/",
    "/ɪɡˈnɔːrd/",
    "/wɔːrnd/",
    "/ɪmˈbærəst/",
    "/ˈrænsækt/",
    "/ˈɛnviəs/",
    "/dɪsˈɡʌstɪŋ/",
    "/bruːzd/",
    "/stroʊl/",
    "/rɪˈkʌvərd/",
    "/ɪnˈɡroʊst/",
    "/kraɪd/",
    "/ɡreɪz/",
    "/waɪt/",
    "/trɪp/",
    "/ˌɪnkənˈsɪdərɪt/"
  ],
  "sentences": [
    "The anxious parents constantly reminded their children to revise their work as the examinations were coming.",
    "The audience was entertained by the clown's amusing tricks.",
    "Tom was green with envy when he saw his neighbour's brand new car.",
    "I stood nervously before my mother because I had broken her favourite vase.",
    "The two ladies whispered to each other so that no one could hear them.",
    "Everyone was begging her to stay, but she ignored them and walked off.",
    "During assembly, the discipline master warned all students to stay away from the ferocious dog.",
    "When John realised that he had worn his pyjamas to school, he was embarrassed.",
    "The burglars ransacked the house and took all the valuables.",
    "When Janet showed us the expensive watch her parents had bought for her, all of us were envious.",
    "\"Get rid of that cockroach at once! It's dirty and disgusting,\" Mother preered.",
    "Benson bruised his knee when he fell from the bicycle.",
    "Every morning, Uncle James would take a stroll in the park.",
    "After resting for two weeks, Tom has finally recovered.",
    "The boys were so engrossed in their class game that they did not hear their parents calling them.",
    "\"Ouch!\" Little ugly duckling cried out in pain when the geese bit it.",
    "The little shepherd took his cattle up the hill so that they could graze on the grass.",
    "John's face was as white as a sheet of paper when he saw the ghostly figure.",
    "The pupils were very excited about their field trip to the museum.",
    "Mr and Mrs Lim are very inconsiderate. They always disturb the peace and quiet of the neighbourhood by singing karaoke loudly late into the night."
  ]
}
