{
  "category": "English Spelling 2025",
  "title": "Unit 1 - Making Ice-Cream",
  "subtitle": "Unit 1",
  "testdate": "Test Date 16/01/2025",
  "words": [
    "equipment",
    "ingredients",
    "recipe",
    "delicious",
    "important",
    "dissolved",
    "wolfed down",
    "sturdy",
    "disappeared",
    "varieties",
    "sprinkled",
    "tightly",
    "screwed",
    "clinked",
    "patient",
    "wrapped",
    "decided",
    "mixture",
    "chocolate",
    "remember"
  ],
  "meanings": [
    "tools, machines that you need to do a particular job",
    "a food that is used with other foods in the preparation of a particular dish",
    "a set of instructions for cooking a particular type of dish",
    "highly pleasant to the taste",
    "of great significance or value",
    "to mix a solid substance into a liquid so that it becomes included in it;",
    "to eat food",
    "strong and solidly built",
    "cease to be visible synonym: vanish",
    "the quality or state of being different; many different types",
    "to drop a few pieces over something",
    "firmly or closely",
    "an act of twisting or turning to fasten or tighten something",
    "to make a short ringing sound like pieces of glass or metal knocking lightly together",
    "able to accept or tolerate delays, problems, or suffering without becoming annoyed or anxious",
    "to cover something with paper, cloth, or other materials",
    "to choose something after thinking carefully about several possibilities",
    "a combination of different things",
    "a hard, brown, sweet food made from cocoa beans",
    "to have or keep an image in your memory of an event, a person, a place, etc. from the past"
  ],
  "meanings_cn": [
    "设备",
    "成分",
    "食谱",
    "美味的",
    "重要的",
    "溶解的",
    "狼吞虎咽",
    "结实的",
    "消失",
    "种类",
    "撒",
    "紧紧地",
    "拧紧",
    "叮当作响",
    "耐心的",
    "包裹",
    "决定",
    "混合物",
    "巧克力",
    "记住"
  ],
  "pronunciation": [
    "/ɪˈkwɪpmənt/",
    "/ɪnˈɡriːdiənts/",
    "/ˈrɛsɪpi/",
    "/dɪˈlɪʃəs/",
    "/ɪmˈpɔːtənt/",
    "/dɪˈzɒlvd/",
    "/wʊlft daʊn/",
    "/ˈstɜːdi/",
    "/dɪsəˈpɪəd/",
    "/vəˈraɪɪtiːz/",
    "/ˈsprɪŋkld/",
    "/ˈtaɪtli/",
    "/skruːd/",
    "/klɪŋkt/",
    "/ˈpeɪʃənt/",
    "/ræpt/",
    "/dɪˈsaɪdɪd/",
    "/ˈmɪkstʃər/",
    "/ˈtʃɒklɪt/",
    "/rɪˈmɛmbər/"
  ],
  "sentences": [
    "The students brought the equipment to class to make ice cream.",
    "You mix all the ingredients together in a bowl.",
    "Follow the recipe closely to bake the butter cake.",
    "The food prepared by my mother was delicious.",
    "The most important step is to keep the heat low so that we will not burn our food.",
    "She added the sugar in the coffee and stirred till it dissolved.",
    "He wolfed down his food quickly during recess.",
    "It takes eight people to carry the sturdy dining table.",
    "The book has disappeared from the shelf.",
    "There are many varieties of food at the buffet table.",
    "I sprinkled some sugar on top of the cake.",
    "The baby was holding on to the toy car tightly.",
    "The boys screwed the lids on the jar tightly before shaking.",
    "The ice clinked as she dropped it into the glass.",
    "The mother is very patient when her child cries loudly.",
    "She wrapped the present and tied it with ribbon.",
    "She decided to travel to India at the end of the year.",
    "The pie was filled with a mixture of nuts and fruits.",
    "The cake recipe calls for 100g of chocolate.",
    "He will always remember his first day at Maris Stella."
  ]
}
