{
  "category": "English Spelling 2025",
  "title": "Unit 4 - The World Beyond Us",
  "subtitle": "Unit 4",
  "testdate": "Test Date 10/04/2025",
  "words": [
    "eclipse",
    "asteroid",
    "comet",
    "ellipse",
    "extinction",
    "telescope",
    "predict",
    "orbit",
    "navigate",
    "regularly",
    "infinitely",
    "protection",
    "phenomena",
    "planet",
    "interacts",
    "trapped",
    "unique",
    "reflects",
    "experience",
    "interestingly"
  ],
  "meanings": [
    "an eclipse of the Sun in whichthe moon does not cover theentire disc of the Sun",
    "an object like a very large rockthat goes round the sun like aplanet",
    "comet is a small chunk of dustand ice that orbits, or travelsaround the sun.",
    "a shape that looks like an oval",
    "a situation that happens whensomething, such as a plant oran animal species, has diedout completely",
    "A telescope is an instrumentthat allows people to seedistant objects.",
    "to say that something willhappen in the future",
    "a curved path followed by aplanet or an object as it movesaround another planet, star,moon, etc.",
    "plan and direct the course of a ship, aircraft, or other form of transport; often by using a map",
    "at repeated times, with equalor similar amounts of timebetween one time and the next",
    "used to describe having no limits,just like space",
    "the act of protecting or state ofbeing protected",
    "the plural form of 'phenomenon',which is a fact or event that is unusual",
    "an obiect that orbits the Sun",
    "to communicate with or react to",
    "to be placed in a restricted position",
    "being the only existing one of itstype or, more generally, unusual,or special in some way",
    "to show, express, or be a sign of something",
    "something that happens to youthat affects how you feel",
    "in a way that attracts youattention because it is special.exciting or unusual"
  ],
  "meanings_cn": [
    "eclipse",
    "asteroid",
    "comet",
    "ellipse",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "pronunciation": [
    "eclipse",
    "asteroid",
    "comet",
    "ellipse",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "sentences": [
    "The universe is infinitely large.",
    "The shady trees provide protection against the burning rays of the sun.",
    "Even scientists do not comprehend these phenomena.",
    "Scientists are studying photographs of the planet for signs of life.",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ]
}
