{
  "category": "English Spelling 2025",
  "title": "Unit 4 - The World Beyond Us",
  "subtitle": "Unit 4",
  "testdate": "Test Date 10/04/2025",
  "words": [
    "eclipse",
    "asteroid",
    "comet",
    "ellipse",
    "extinction",
    "telescope",
    "predict",
    "orbit",
    "navigate",
    "regularly",
    "infinitely",
    "protection",
    "phenomena",
    "planet",
    "interacts",
    "trapped",
    "unique",
    "reflects",
    "experience",
    "interestingly"
  ],
  "meanings": [
    "an eclipse of the Sun in which the moon does not cover the entire disc of the Sun",
    "an object like a very large rock that goes round the sun like a planet",
    "a small chunk of dust and ice that orbits, or travels around the sun",
    "a shape that looks like an oval",
    "a situation that happens when something, such as a plant or an animal species, has died out completely",
    "an instrument that allows people to see distant objects",
    "to say that something will happen in the future",
    "a curved path followed by a planet or an object as it moves around another planet, star, moon, etc.",
    "plan and direct the course of a ship, aircraft, or other form of transport; often by using a map",
    "at repeated times, with equal or similar amounts of time between one time and the next",
    "used to describe having no limits, just like space",
    "the act of protecting or state of being protected",
    "the plural form of 'phenomenon', which is a fact or event that is unusual",
    "an object that orbits the Sun",
    "to communicate with or react to",
    "to be placed in a restricted position",
    "being the only existing one of its type or, more generally, unusual, or special in some way",
    "to show, express, or be a sign of something",
    "something that happens to you that affects how you feel",
    "in a way that attracts your attention because it is special, exciting or unusual"
  ],
  "meanings_cn": [
    "日食（月亮未完全遮住太阳的日食）",
    "小行星（围绕太阳运行的类岩石大型天体）",
    "彗星（由尘埃和冰组成绕太阳运行的小天体）",
    "椭圆（类似卵形的形状）",
    "灭绝（某物种完全消失的状态）",
    "望远镜（观测远处物体的仪器）",
    "预测（预言未来会发生的事情）",
    "轨道（行星或天体绕行另一天体的曲线路径）",
    "导航（规划并指引船只、飞机等交通工具的路线）",
    "定期地（以固定或相似时间间隔重复发生）",
    "无限地（形容像宇宙一样没有边界）",
    "保护（保护的行为或被保护的状态）",
    "现象（phenomenon的复数形式，指不寻常的事实或事件）",
    "行星（围绕太阳运行的天体）",
    "互动（与他人交流或反应）",
    "被困（处于受限制的位置）",
    "独特的（唯一存在的，或特别不寻常的）",
    "反映（显示、表达或象征某事物）",
    "经历（影响你感受的遭遇）",
    "有趣地（以吸引注意力的特殊或令人兴奋的方式）"
  ],
  "sentences": [
    "While we were learning about the lunar eclipse, we viewed many astronomy videos.",
    "New evidence supports the theory that the dinosaurs were wiped out by an asteroid.",
    "It was predicted that a comet would collide with one of the planets.",
    "The Earth orbits in an ellipse.",
    "A comet colliding with the earth may have caused the mass extinction of the dinosaurs.",
    "With a telescope, you can see the mountains on the moon.",
    "It's impossible to predict the weather accurately.",
    "Once in space, the spacecraft will go into orbit around Earth.",
    "Sailors have special equipment to help them navigate.",
    "Keep healthy by eating well and exercising regularly.",
    "The universe is infinitely large.",
    "The shady trees provide protection against the burning rays of the sun.",
    "Even scientists do not comprehend these phenomena.",
    "Scientists are studying photographs of the planet for signs of life.",
    "Peter’s teacher says that he interacts well with the other children.",
    "Two passengers are still trapped in the wreck.",
    "He could recognise his handwriting anywhere – it’s unique.",
    "His music reflects his interest in Singaporean culture.",
    "I had an unpleasant experience at the dentist's.",
    "His essay was clearly and interestingly written."
  ],
  "pronunciation": [
    "/ɪˈklɪps/",
    "/ˈæstərɔɪd/",
    "/ˈkɒmɪt/",
    "/ɪˈlɪps/",
    "/ɪkˈstɪŋkʃn/",
    "/ˈtelɪskəʊp/",
    "/prɪˈdɪkt/",
    "/ˈɔːrbɪt/",
    "/ˈnævɪɡeɪt/",
    "/ˈreɡjələrli/",
    "/ˈɪnfɪnətli/",
    "/prəˈtekʃn/",
    "/fəˈnɒmɪnə/",
    "/ˈplænɪt/",
    "/ˌɪntərˈækts/",
    "/træpt/",
    "/juˈniːk/",
    "/rɪˈflekts/",
    "/ɪkˈspɪəriəns/",
    "/ˈɪntrəstɪŋli/"
  ]
}
