{
  "category": "English Spelling 2025",
  "title": "Unit 2 - Life of a Vet",
  "subtitle": "Unit 2",
  "testdate": "Test Date 31/01/2025",
  "words": [
    "examine",
    "delicate",
    "sensitive",
    "volunteer",
    "responsibility",
    "calculate",
    "stressful",
    "discomfort",
    "patiently",
    "disability",
    "leash",
    "mischief",
    "paralysed",
    "adoption",
    "painful",
    "determination",
    "infection",
    "healthy",
    "resilience",
    "injuries"
  ],
  "meanings": [
    "to consider or study an idea or a subject very carefully",
    "Needing careful treatment especially because it is easily damaged or hurt",
    "Aware of and able to understand other people's feelings",
    "a person who offers to do something without being forced to do it",
    "a duty to take care of somebody or something to ensure nothing will go wrong",
    "to determine the number of something",
    "making you feel worried or nervous",
    "a feeling of slight pain or being physically uncomfortable",
    "able to wait for a long time or accept annoying behaviour",
    "a physical or mental condition that makes it difficult for somebody to do some things that most other people can do",
    "a long piece of chain or rope used for holding and controlling",
    "a playful behaviour but does not cause any serious harm",
    "unable to move or act",
    "the process of transferring responsibility for a pet that was previously owned by another person or rescue organisation",
    "cause of suffering",
    "the ability to continue trying hard although it is difficult",
    "an illness that is caused by bacteria or a virus and that affects one part of the body",
    "strong, fit and well",
    "the ability to be happy and successful again after something bad has happened",
    "harm done to a person's or an animal's body"
  ],
  "meanings_cn": [
    "检查",
    "精致的",
    "敏感的",
    "志愿者",
    "责任",
    "计算",
    "压力大的",
    "不适",
    "耐心地",
    "残疾",
    "皮带",
    "恶作剧",
    "瘫痪的",
    "收养",
    "疼痛的",
    "决心",
    "感染",
    "健康的",
    "恢复力",
    "伤害"
  ],
  "pronunciation": [
    "/ɪɡˈzæmɪn/",
    "/ˈdɛlɪkət/",
    "/ˈsɛnsɪtɪv/",
    "/ˌvɒlənˈtɪər/",
    "/rɪˌspɒnsəˈbɪlɪti/",
    "/ˈkælkjʊleɪt/",
    "/ˈstrɛsfl/",
    "/dɪsˈkʌmfət/",
    "/ˈpeɪʃəntli/",
    "/ˌdɪsəˈbɪlɪti/",
    "/liːʃ/",
    "/ˈmɪstʃɪf/",
    "/ˈpærəlaɪzd/",
    "/əˈdɒpʃən/",
    "/ˈpeɪnfʊl/",
    "/dɪˌtɜːmɪˈneɪʃən/",
    "/ɪnˈfɛkʃən/",
    "/ˈhɛlθi/",
    "/rɪˈzɪlɪəns/",
    "/ˈɪndʒəriz/"
  ],
  "sentences": [
    "The police took a long time to examine the evidence.",
    "Babies have very delicate skin which can be bruised easily.",
    "She is very sensitive to other people's feelings.",
    "He wants to volunteer to help out in an animal shelter.",
    "Jacob is given the responsibility to carry out his duty as the class monitor this year.",
    "You will have to calculate how much to pay for the books.",
    "It will be a stressful time for all students during the examination period.",
    "You will experience some discomfort after the surgery.",
    "Everyone waited patiently for me to complete my work.",
    "He is able to paint with his feet despite his disability of being born without arms.",
    "All dogs must be kept on a leash in public places.",
    "The boys were given a warning by their teacher for getting into mischief.",
    "The accident left him paralysed from the waist down.",
    "The family decided to put their pet dog up for adoption.",
    "My ankle is still too painful to walk.",
    "She has the determination to complete the one thousand pieces of jigsaw puzzles.",
    "Sneezing is the most common way of spreading an infection.",
    "He eats well and exercises regularly to keep himself healthy.",
    "He showed courage and resilience to finish the race after he fell.",
    "Jane suffered serious injuries after the accident."
  ]
}
