{
    "category": "English Spelling 2024",
    "title": "Unit 9 - Spilt Milk",
    "subtitle":"Unit 9",
    "testdate":"Test Date 02/10/2024",
    "words":["tempt","flung","exclaimed","groaned","protested","reminded","jabbed","wafted","disappeared","cautiously","profusely","peek","vision","disaster","adventure","edge","summit","jetty","cutlery","invigilator"],
	"meanings":["to make someone want to have or do something, especially something that is unnecessary or wrong","to throw something or someone suddenly and with a lot of force","to say or shout something suddenly because of surprise, fear, pleasure","to make a deep, long sound showing great pain or unhappiness","to say or do something to show that you are against something","to make someone think of something they have forgotten or might have forgotten","to push or hit something forcefully and quickly, often with a thin or sharp object","to move gently through the air","be lost or go missing, or become impossible to find","in a careful and well-considered way that avoids risk","with a large amount of something","to look at something for a short time","the ability to see","an event causing great harm, damage, or suffering","an unusual, exciting, and possibly dangerous activity, such as a trip","the outer or furthest point of something","the highest point of a mountain","a wide stone wall or wooden platform where boats stop to let people get on or off, or to load or unload goods","knives, forks and spoons used for eating food","a person whose job is to watch people taking an examination in order to check that they do not cheat"],
	"meanings_cn":[
        "诱惑",
        "猛扔",
        "喊叫",
        "呻吟",
        "抗议",
        "提醒",
        "戳",
        "飘荡",
        "消失",
        "小心地",
        "大量地",
        "偷看",
        "视力",
        "灾难",
        "冒险",
        "边缘",
        "顶峰",
        "码头",
        "餐具",
        "监考人"
    ],
	"pronunciation":[
        "/tɛmpt/",
        "/flʌŋ/",
        "/ɪkˈskleɪmd/",
        "/ɡrəʊnd/",
        "/prəˈtɛstɪd/",
        "/rɪˈmaɪndɪd/",
        "/dʒæbd/",
        "/ˈwɒftɪd/",
        "/dɪsəˈpɪəd/",
        "/ˈkɔːʃəsli/",
        "/prəˈfjuːsli/",
        "/piːk/",
        "/ˈvɪʒən/",
        "/dɪˈzɑːstə/",
        "/ədˈvɛntʃər/",
        "/ɛdʒ/",
        "/ˈsʌmɪt/",
        "/ˈdʒɛti/",
        "/ˈkʌtləri/",
        "/ɪnˈvɪdʒɪleɪtər/"
    ],
    "sentences":["Danny tried to tempt his friends to take some cookies from the jar.","He crumpled up the letter and flung it into the fire.","She exclaimed in delight upon hearing the good news.","He groaned with pain and collapsed to the ground.","My brother protested when Father told him to go to bed early.","Mother reminded Sam about his medical appointment this afternoon.","The vet jabbed the syringe into the kitten's leg.","A gentle breeze wafted the scent of roses in through the open window.","The moon disappeared behind a cloud.","He moved slowly and cautiously along the dark rocky path.","She thanked her neighbours profusely for their help when she was away.","They took a peek in the basket and saw packets of noodles, cartons of milk and some apples.","Due to old age, my grandmother has very little vision in her left eye.","Many people died in the tragic air disaster.","Jack shared his exciting adventure when he travelled to Africa.","He put pink icing around the edge of the cake.","We climbed to the summit of Mount Rainier.","Alan jumped ashore and tied the rowboat up to the small wooden jetty.","David helped to arrange the cutlery on the dining table in preparation for the family dinner.","The invigilator walked up and down between the desks to check that the students did not cheat."]
}