{
  "category": "Learning Lab 2025",
  "title": "Feelings and Emotions",
  "subtitle": "Volcabulary 1",
  "testdate": "19/05/2024",
  "words": [
    "delighted",
    "thrilled",
    "ecstatic",
    "on cloud nine",
    "in high spirits",
    "with a heavy heart",
    "crestfallen",
    "dejected",
    "downcast",
    "repentant",
    "remorseful",
    "annoyed",
    "exasperated",
    "incensed",
    "fume / is fuming",
    "infuriated",
    "see red",
    "uneasy",
    "apprehensive",
    "fearful",
    "alarmed",
    "petrified",
    "somebody's heart is in their mouth",
    "startled",
    "astounded",
    "dumbfounded",
    "flabbergasted",
    "be taken aback",
    "be caught off guard"
  ],
  "meanings": [
    "very pleased",
    "very excited and pleased",
    "very happy and excited",
    "extremely happy",
    "extremely happy or energetic",
    "with great sadness",
    "sad and disappointed",
    "unhappy and disappointed",
    "sad or depressed",
    "feeling or showing that you are sorry",
    "feeling extremely sorry",
    "slightly irritated",
    "extremely annoyed",
    "very angry",
    "be very angry about something",
    "extremely angry",
    "become very angry",
    "feeling worried or unhappy about a situation",
    "worried or scared that something unpleasant may happen",
    "anxious and afraid",
    "worried or frightened that something dangerous or unpleasant may happen",
    "extremely frightened",
    "somebody feels anxious or frightened about something",
    "slightly shocked or frightened because of something sudden that happened",
    "very surprised or shocked",
    "unable to speak because you are surprised by something",
    "extremely surprised or shocked",
    "be shocked by somebody or something",
    "be unprepared for something difficult or dangerous"
  ],
  "meanings_cn": [
    "非常高兴的",
    "兴奋不已的",
    "狂喜的",
    "欣喜若狂",
    "兴高采烈",
    "心情沉重地",
    "垂头丧气的",
    "沮丧的",
    "情绪低落的",
    "悔悟的",
    "懊悔的",
    "恼怒的",
    "暴怒的",
    "愤怒的",
    "愤怒/正在发怒",
    "狂怒的",
    "大怒",
    "不安的",
    "忧虑的",
    "害怕的",
    "惊慌的",
    "吓呆的",
    "心惊胆战",
    "受惊的",
    "震惊的",
    "惊呆的",
    "目瞪口呆的",
    "大吃一惊",
    "措手不及"
  ],
  "pronunciation": [
    "/dɪˈlaɪtɪd/",
    "/θrɪld/",
    "/ɪkˈstætɪk/",
    "/ɒn klaʊd naɪn/",
    "/ɪn haɪ ˈspɪrɪts/",
    "/wɪð ə ˈhɛvi hɑːrt/",
    "/ˈkrɛstˌfɔːlən/",
    "/dɪˈdʒɛktɪd/",
    "/ˈdaʊnkɑːst/",
    "/rɪˈpɛntənt/",
    "/rɪˈmɔːrsfəl/",
    "/əˈnɔɪd/",
    "/ɪɡˈzæspəreɪtɪd/",
    "/ɪnˈsɛnst/",
    "/fjuːm/ /ɪz ˈfjuːmɪŋ/",
    "/ɪnˈfjʊərieɪtɪd/",
    "/siː rɛd/",
    "/ʌnˈiːzi/",
    "/ˌæprɪˈhɛnsɪv/",
    "/ˈfɪəfəl/",
    "/əˈlɑːrmd/",
    "/ˈpɛtrɪfaɪd/",
    "/ˈsʌmbədiːz hɑːrt ɪz ɪn ðeə maʊθ/",
    "/ˈstɑːrtld/",
    "/əˈstaʊndɪd/",
    "/ˌdʌmˈfaʊndɪd/",
    "/ˈflæbərɡæstɪd/",
    "/bi ˈteɪkən əˈbæk/",
    "/bi kɔːt ɒf ɡɑːrd/"
  ],
  "sentences": [
    "Thea was delighted to find a gift waiting for her on her desk when she stepped into class.",
    "Gregory was thrilled that his parents were taking him to Japan during the June school holidays.",
    "The fans were ecstatic when the band announced that they were coming to Singapore.",
    "Myra was on cloud nine upon learning that she was representing her school at the competition.",
    "My sister was in high spirits yesterday after clinching first place in the talent show.",
    "With a heavy heart, the veterinarian advised Fred that his pet would not make it through the night.",
    "The children were crestfallen when the excursion to the amusement park was cancelled.",
    "Dejected that she had failed to make the cut for the school team, Clara cried all the way home.",
    "One look at Glenda’s downcast expression told us that she had not done well for the audition.",
    "To show how deeply repentant she was for accidentally deleting the document, Amelie volunteered to redo the whole project.",
    "Feeling remorseful for his insensitive prank, my brother prepared a delicious lunch as an apology.",
    "Annoyed by how slow the cashier was, the customer urged her to hurry.",
    "Exasperated by my brother’s endless questions, I chased him out of my bedroom.",
    "The participants were incensed by the judges’ pick for the winner as it was clear that they were biased.",
    "The service staff were silently fuming at the tourists’ rude behaviour.",
    "Felicia was so infuriated by the rowdy boys in the library that she gave them a piece of her mind.",
    "Mum saw red when she witnessed the destruction Toby’s new pet had caused in the living room.",
    "The strange man loitering at the void deck made Delia feel extremely uneasy.",
    "Xavier was apprehensive about accepting the role for the school musical as he had stage fright.",
    "Fearful of the invading soldiers, the villagers ran into the mountains to hide.",
    "I was alarmed to find the front door ajar upon returning home from school.",
    "Petrified of heights, Julie refused to take the roller coaster despite her sister's reassurances that it was safe.",
    "My heart was in my mouth as I watched the firefighters struggle to put out the roaring flames.",
    "I was startled when I suddenly heard a loud beeping sound coming from the living room.",
    "The tourists were astounded by the sheer size of the mountain before them.",
    "The principal's announcement that the school was closing down left the class dumbfounded.",
    "Flabbergasted by the turn of events on stage, the host was at a loss for words.",
    "I was taken aback when my neighbour suddenly appeared at the front door.",
    "The people at the beach were caught off guard by the towering waves rolling towards them."
  ]
}
