{
    "category": "Learning Lab 2023",
    "title": "T4W12 - Phenomenal Polyglots",
    "subtitle":"T4W12",
    "testdate":"05/12/2023",
    "words": [
        "",
        "Stumped",
        "",
        "",
        "brag",
        "",
        "",
        "fluently",
        "",
        "feat",
        "immersed",
        "passion",
        "",
        "the lengths he goes to",
        "",
        "brush up"
    ],
    "meanings": [
        "",
        "confused / puzzled",
        "",
        "",
        "boast / crow",
        "",
        "",
        "effortlessly / easily",
        "",
        "achievement",
        "absorbed",
        "enthusiasm",
        "",
        "putting a lot of effort into doing something",
        "",
        "improve"
    ],
    "meanings_cn": [
        "Joey 带着微笑问他的妹妹：你觉得是什么让我们和地球上其他动物不同呢？",
        "被问题难倒了, Lisa 心里想着, “嗯，所有的生物都需要食物、空气和住所…”",
        "厌倦了等待，Joey 打断了，“我们可以通过语言交流！”",
        "“不像动物和昆虫通过叫声和动作交流，人类使用具有意义的符号来与周围的人分享我们的想法！”Joey 继续说道。",
        "“我只会说两种语言，所以没什么好吹嘘的。不过，我知道美国有个人把他的沟通技能用得很好。",
        "他叫蒂莫西·多纳，他能说23种语言！”Joey 兴奋地说道。",
        "“那不可能是真的！”Lisa 惊讶地说道。",
        "Joey 解释道，“语言学家称他和像他这样的人为‘超级多语者’。多语者是指能够流利地运用多种语言进行交流的人。",
        "而超级多语者是指能够阅读和书写12种或更多语言的人。”",
        "Lisa开始在客厅的电脑上搜索有关这个能够做出如此惊人壮举的人的文章。",
        "扫描页面，Lisa 大声读道，“蒂莫西·多纳从小就说英语。当他13岁时，他开始学习希伯来语，从那时起他就沉浸在学习许多不同语言的过程中。”",
        "“他对语言的热情让他在网上发布了许多自己用不同语言说话的视频，以便母语者可以就发音、词汇选择和语法使用给他反馈，”Lisa 继续说道。",
        "Lisa说：“哇！蒂莫西每天还会花上15个小时来学习语言书籍。此外，他还会在互联网上搜索语言学习材料，或者阅读外语新闻！”",
        "“太不可思议了！我真的很钦佩他为自己的热情所付出的努力！”Joey 惊叹道。",
        "“Joey，你想学第三种语言吗？我想学韩语，这样我就可以跟着好听的韩国流行歌曲唱了！”Lisa 宣布道。",
        "“我觉得你应该先提高你的英语和普通话水平！”Joey 调侃着，在他妹妹的怒视下飞快地跑开了。"        
    ],
    "pronunciation":[
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "sentences": [
        "\"What do you think makes us different from the animals living on our planet?\" Joey asked his sister with a grin.",
        "Stumped by question, Lisa though aloud. \"Well, all living things need food, air, and shelter...\"",
        "Tired of waiting, Joey interrupted. \"We can communicate through languages!\"",
        "\"Unlike animals and insects that communicate through calls and actions, humans use symbols that carry meaning to share our throughts with others around us!\" Joey continued.",
        "\"I can only speak two languages, so that's nothing to brag about. However, I know of a person in the United States who puts his communication skills to good use.",
        "His name is Timothy Doner and he can speak 23 languages!\" Joey enthused.",
        "\"That cannot be true!\" Lisa exclaimed in disbelief.",
        "Joey explained, \"Linguists call him and people like him 'hyperpolyglots'. A polyglot is a person who can communicate fluently in several languages.",
        "A hyperpolyglot is a person who can read and write in 12 or more languages.\"",
        "Using the computer in the living room, Lisa began looking up articles on this person capable of such an amazing feat.",
        "Scanning the page, Lisa read aloud, \"Timothy Doner grew up speaking English. When he was 13, he started picking up Hebrew and has immersed himself in learning many differents since then.\"",
        "\"His passion on languages has led him to post videos of himself speaking in different languages online so that native speakers can give him feedback on pronunciation, choice of vocabulary and use of grammer,\" Lisa continued.",
        "Lisa said, \"Wow! Timothy also speaks up to 15 hours a day studying language books. In addition, he searches the Internet for language-learning materials or reads the news in foreign languages!\"",
        "\"That's incredible! I really admire the lengths he goes to for his passion!\" Joey marvelled.",
        "\"Would you like to pick up a third language, Joey? I want to learn Korean so that I can sing along to catchy Korean pop songs!\" Lisa declared.",
        "\"I think you should brush up on your English and Mandarin first!\" Joey teased before dashing away to avoid his sister's glare."
    ]
}