{
    "category": "Learning Lab 2024",
    "title": "T1W7 - Term 1 Practice Test 1",
    "subtitle":"T1W7",
    "testdate":"26/01/2024",
    "words": [
        "",
        "",
        "doodie",
        "",
        "glared daggers at him",
        "trudged",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "meanings": [
        "",
        "",
        "drawing / sketch",
        "",
        "to look at someone in an angry way",
        "plodded / walked with heavy steps",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""           
    ],
    "meanings_cn": [
        "对于莱纳德来说，数学课就像去看牙医一样 - 它们应该对你有好处，但它们也是痛苦的，几乎总是以泪水结束。",
        "在又一节艰难的数学课后的某一天，他悄悄溜到厕所洗掉脸上的泪水。",
        "神秘的帮手没有留下名字，只在纸的一角画了一个微笑的太阳。",
        "这个人没有像其他人一样取笑他，而是通过提供帮助来对他表示善意，帮他做家庭作业。",
        "莱纳德抗议了。当不止一个同学瞪着他时，他最终坐下来，两颊通红。",
        "当最后的铃声响起时，莱纳德沉重地走出教室。他没有看到玛雅跟在他后面，也没有看到她偷偷塞进他书包里的小纸条。",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""   
    ],
    "pronunciation":[
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "sentences": [
        "For Leonard, mathematics classes were like visits to the dentist - they were supposed to be good for you, but they were also painful and almost always ended in tears.",
        "One day, after another difficult mathematics lesson, he quietly slipped away to the toilet to wash the tears from his face.",
        "The mystery helper had left no name, only a small doodie of a smiling sun in a corner of the paper.",
        "Instead of making fun of him like everyone else, this person had shown him kindness by offering him help on his homework.",
        "Leonard protested. When more than one classmate glared daggers at him, he finally sat down with his cheeks flaming.",
        "When the final bell rang, Leonard trudged out of the calssroom. He did not see Maia following him, nor did he see the small note she had slipped into his bag.",
        "As the sun began to set. Alex went out to the field behind his grandparents' house for a walk with them.",
        "The evening breeze was cool and the air was filled with the scent of freshly cut grass.",
        "As Alex skipped ahead of the elderly couple, his eyes caught a glimpse of something unusual in the tall grass. As first, he thought his imagination was playing trick on him.",
        "However, as he squinted, focusing on the spot where the grass seemed to rustle, he saw it - a pair of soft and fluffy ears sticking out of the grass.",
        "Alex could not believe his eyes. The rabbit, with its soft, white fur and twitching nose, was nibbling on a dandelion, completely unware of his presence. He stood there, mesmerised by the sight.",
        "Alex's heart pounded with excitement. He wanted to call out to his grandparents to come quickly, so they could share this magical moment,",
        "but he feared any sound or movement might scare the rabbit away. So, he remained perfectly still and quiet as he watched it from a distance."
    ]
}