{
    "category": "论语 Sayings of Confucius",
    "title": "第一篇：学而",
    "subtitle":"学而篇 (16章)",
    "sentences": [
        "子曰：“学而时习之，不亦说乎？有朋自远方来，不亦乐乎？人不知而不愠，不亦君子乎？”",
        "有子曰：“其为人也孝弟，而好犯上者，鲜矣；不好犯上而好作乱者，未之有也。君子务本，本立而道生。孝弟也者，其为仁之本与！”",
        "子曰：“巧言令色，鲜矣仁！”",
        "曾子曰：“吾日三省吾身：为人谋而不忠乎？与朋友交而不信乎？传不习乎？”",
        "子曰：“道千乘之国，敬事而信，节用而爱人，使民以时。”",
        "子曰：“弟子入则孝，出则弟，谨而信，泛爱众，而亲仁，行有余力，则以学文。”",
        "子夏曰：“贤贤易色；事父母，能竭其力；事君，能致其身；与朋友交，言而有信。虽曰未学，吾必谓之学矣。”",
        "子曰：“君子不重则不威，学则不固。主忠信，无友不如己者，过，则勿惮改。”",
        "曾子曰：“慎终追远，民德归厚矣。”",
        "子禽问于子贡曰：“夫子至于是邦也，必闻其政，求之与，抑与之与？”子贡曰：“夫子温、良、恭、俭、让以得之。夫子之求之也，其诸异乎人之求之与？”",
        "子曰：“父在，观其志；父没，观其行；三年无改于父之道，可谓孝矣。”",
        "有子曰：“礼之用，和为贵。先王之道，斯为美。小大由之，有所不行。知和而和，不以礼节之，亦不可行也。”",
        "有子曰：“信近于义，言可复也。恭近于礼，远耻辱也。因不失其亲，亦可宗也。”",
        "子曰：“君子食无求饱，居无求安，敏于事而慎于言，就有道而正焉，可谓好学也已。”",
        "子贡曰：“贫而无谄，富而无骄，何如？”子曰：“可也。未若贫而乐，富而好礼者也。”子贡曰：“《诗》云：‘如切如磋，如琢如磨’，其斯之谓与？”子曰：“赐也，始可与言《诗》已矣，告诸往而知来者。”",
        "子曰：“不患人之不己知，患不知人也。”"
    ],
    "pinyin":[
        "Zǐ yuē : Xué ér shí xí zhī , bù yì yuè hū ? Yǒu péng zì yuǎn fāng lái , bù yì lè hū ? Rén bù zhī ér bù yùn , bù yì jūn zǐ hū ?",
        "Yǒu zǐ yuē : Qí wéi rén yě xiào dì , ér hào fàn shàng zhě , xiān yǐ ; bù hào fàn shàng ér hào zuò luàn zhě , wèi zhī yǒu yě . Jūn zǐ wù běn , běn lì ér dào shēng . Xiào dì yě zhě , qí wéi rén zhī běn yǔ !",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "audioFileName": [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "EngAge5":[
        "Isn't it fun to learn new things and practice them sometimes? And isn't it great when friends come to play from far away? Being nice even if others don't understand you, that's what good kids do, right?",
        "Being respectful and kind is very important. People who like to disobey their elders are very rare. And those who do not disobey but like to cause trouble almost don't exist. Good people focus on being good from the start. Being respectful and kind is the beginning of being good!",
        "Being nice with words and appearance doesn't mean being kind!'",
        "I examine myself three times a day: Am I not sincere when helping others? Do I not trust my friends? Do I not review what I've learned?",
        "In governing a large country, the way is to be respectful, trustworthy, frugal, and loving towards people, so that the people can live in harmony.",
        "When you're at home, be good to your family. When you're out, be kind to others. Be careful and honest. Love everyone and be friendly. Respect and be kind to good people. And when you have energy left, learn new things.",
        "Be good and don't judge people by how they look. Help your parents with all your might. Serve your leaders with all your heart. Be honest and keep your promises when you're with friends. Even if you haven't started school yet, this is still learning.",
        "A good person is not always strict but still respected, and they keep learning new things. Be honest and trustworthy. Choose friends who are as good as you. If you make a mistake, don't be afraid to change.",
        "Be careful and remember those who came before us, and people will become kind-hearted.",
        "When Confucius visited a country, did he listen to its leaders' policies, seek to help, or wait to be asked for help? Confucius was warm, kind, respectful, frugal, and humble, and that's how he gained their trust. Was Confucius' way of helping different from how others help?",
        "Watch your father's intentions while he's here. Watch his actions after he's gone. If you keep following your father's teachings for three years without changing, you're truly being filial.",
        "",
        "",
        "",
        "",
        ""
    ],
    "EngAge9":[
        "Isn't it fun to learn new things and practice them? And isn't it exciting when friends visit from far away? Being kind even when others don't understand you, isn't that what makes you really cool?",
        "It's really rare to find someone who is both respectful and kind but still likes to disobey their elders. And it's even rarer to find someone who doesn't disobey but likes to cause trouble. Good people focus on being good from the beginning. Being respectful and kind is where kindness starts!",
        "Being clever with words and looking nice doesn't mean you're kind!",
        "I check myself three times a day: Am I not honest when I help others? Do I not trust my friends? Do I not review what I've learned?",
        "When you're with your family, be respectful and helpful. When you're with others, be kind and considerate. Always be honest and trustworthy. Show love and kindness to everyone. Respect and be close to those who are good. And when you have time and energy, focus on learning new things.",
        "Be wise and don't judge others based on their appearance. Help your parents with all your strength. Serve your leaders with your whole being. Be truthful and keep your word when you're with friends. Even if you're not officially studying yet, these are important lessons.",
        "A noble person isn't always strict but still commands respect, and they keep learning. Prioritize loyalty and honesty. Surround yourself with friends who are as good as you. If you make a mistake, don't hesitate to make things right.",
        "Remember and honor those who passed away with care, and people will become morally upright.",
        "When Confucius went to different places, did he listen to their leaders' rules, offer his help, or wait to be asked? Confucius was gentle, kind, respectful, thrifty, and humble, and that's how he gained their trust. Was Confucius' way of offering help different from how others do it?",
        "Observe your father's intentions while he's alive. Observe his actions after he's passed away. If you continue to follow your father's teachings for three years without deviation, you can truly be called filial.",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "EngAge12":[
        "Isn't it awesome when you learn something and get to use it? And isn't it super cool when friends come to hang out from far away? Being chill even when people don't get you, that's what makes you a real boss, right?",
        "It's very rare to find someone who is both respectful and kind, yet enjoys disobeying authority. And it's almost unheard of to find someone who doesn't disobey but enjoys causing chaos. True gentlemen focus on the basics; when the basics are solid, the right path emerges. Being respectful and kind is the foundation of goodness!",
        "Using clever words and charming looks doesn't necessarily mean you're truly kind!",
        "I examine myself three times a day: Am I not sincere when planning with others? Am I not trustworthy in my friendships? Do I neglect to review what I've learned?",
        "Be good to your family at home and be kind to others when you're outside. Always be truthful and trustworthy. Show love and kindness to everyone around you. Respect and be close to those who are good. And if you have extra time and energy, focus on learning new things.",
        "Be wise and don't judge others by their appearance. Support your parents with all your effort. Serve your leaders with dedication. Be honest and trustworthy in your friendships. Even if you're not formally studying yet, these are lessons in themselves.",
        "A true gentleman isn't always stern but still commands respect, and they continue to learn. Emphasize loyalty and trustworthiness. Surround yourself with friends who are as good as you, or better. If you make a mistake, don't fear making necessary changes.",
        "By carefully commemorating and respecting our ancestors, the moral character of the people becomes rich and profound.",
        "When Confucius arrived in a country, did he listen to its government's policies, offer assistance, or wait to be invited? Confucius was gentle, kind, respectful, thrifty, and humble, and through these qualities, he gained trust and respect. Was Confucius' approach to offering assistance different from others'?",
        "Observe your father's intentions while he's alive. Observe his actions after he's gone. If you remain unchanged in following your father's path for three years, then you're truly practicing filial piety.",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "EngAge18":[
        "Isn't it satisfying to study and apply your knowledge over time? Isn't it fulfilling to welcome friends from distant places? To remain composed when others misunderstand you, that's the mark of true maturity, isn't it?",
        "Rare indeed are those who, while being filial and fraternal, are fond of offending against their superiors. Even rarer are those who, while not inclined to offend against their superiors, are fond of creating disorder. The noble-minded focus on the root; once the root is established, the Way is born. Filial piety and fraternal respect are the foundation of benevolence.",
        "Smooth talk and charming appearance alone don't signify true kindness!",
        "I reflect on myself three times a day: Am I not sincere in my dealings with others? Do I lack trustworthiness in my friendships? Do I fail to review and practice what I've learned?",
        "Practice filial piety at home and show brotherly love when you're out. Be cautious and honest, and let your love extend to everyone. Prioritize relationships with those who are virtuous. And if you have the capacity, dedicate yourself to learning and personal growth.",
        "Be discerning and don't judge others superficially. Assist your parents with all your capabilities. Serve your leaders with dedication. Maintain integrity and honor your word in your friendships. Even if you haven't pursued formal education, these principles embody the essence of learning.",
        "A noble person isn't always imposing but still commands respect, and they remain open to learning. Uphold loyalty and integrity. Surround yourself with friends who are equally admirable. Don't hesitate to make changes if you've made a mistake.",
        "Through careful reflection and reverence for our ancestors, the moral values of society become deeply ingrained.",
        "When Confucius visited a state, did he listen to its governance, offer his help, or wait to be invited? Confucius was gentle, kind, respectful, frugal, and humble, and through these traits, he earned trust and respect. Was Confucius' method of offering assistance different from that of others?",
        "Observe your father's intentions while he's alive. Observe his actions after he's passed away. If you remain steadfast in following your father's teachings for three years, you can truly be considered filial.",
        "",
        "",
        "",
        "",
        "",
        ""
    ]
}