{
    "category": "古诗文",
    "title": "劝学(节选) : (先秦)荀子",
    "subtitle":"劝学",
    "sentences": [
        "君子曰：学不可以已。青，取之于蓝，而青于蓝；冰，水为之，而寒于水。木直中绳，輮以为轮，其曲中规。虽有槁暴，不复挺者，輮使之然也。",
        "故木受绳则直，金就砺则利，君子博学而日参省乎己，则知明而行无过矣。",
        "吾尝终日而思矣，不如须臾之所学也；吾尝跂而望矣，不如登高之博见也。",
        "登高而招，臂非加长也，而见者远；顺风而呼，声非加疾也，而闻者彰。假舆马者，非利足也，而致千里；假舟楫者，非能水也，而绝江河。君子生非异也，善假于物也。",
        "积土成山，风雨兴焉；积水成渊，蛟龙生焉；积善成德，而神明自得，圣心备焉。",
        "故不积跬步，无以至千里；不积小流，无以成江海。骐骥一跃，不能十步；驽马十驾，功在不舍。",
        "锲而舍之，朽木不折；锲而不舍，金石可镂。蚓无爪牙之利，筋骨之强，上食埃土，下饮黄泉，用心一也。蟹六跪而二螯，非蛇鳝之穴无可寄托者，用心躁也。"
    ],
    "pinyin":[
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "audioFileName": [
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "EngAge5":[
        "A noble person said: 'Learning should never stop. Just like how blue dye is made from indigo plants, yet appears even bluer than the plants themselves. Ice is made from water, yet it's colder than water. A straight piece of wood can be used to make a straight ruler, but when bent, it can be used to make a curved wheel. Even if a tree is old and tough, it can still be made straight again with the help of a wheel.'",
        "So, when wood is used with a string, it becomes straight. When metal is sharpened, it becomes useful. A noble person learns widely and reflects on themselves daily, thus gaining knowledge and wisdom, and acting without fault.",
        "I often think all day long, but it's not as good as a moment of learning. I often look up from below, but it's not as good as having a broad view from a high place.",
        "Climbing high doesn't make your arms longer, but you can see far. Calling with the wind doesn't make your voice faster, but others can hear you clearly. Using a carriage and horse doesn't make your feet faster, but you can travel far. Using a boat and oar doesn't mean you can swim, but you can cross rivers and seas. A noble person doesn't have special abilities, but they make good use of what they have.",
        "When soil accumulates, it forms mountains, and they rise when there are wind and rain. When water accumulates, it forms deep pools, and dragons and serpents emerge. When good deeds accumulate, virtues are developed, and divine spirits naturally arise, and a noble heart is complete.",
        "So, if you don't take small steps, you can't walk a thousand miles; if you don't collect small streams, you can't make rivers and seas. Even a fast horse can't go ten steps in one jump; but if you keep at it, even a slow horse can travel far with determination.",
        "If you carve but give up halfway, even rotten wood won't break; if you carve without giving up, you can engrave on gold and stone. Worms have no claws or teeth, and their bodies are weak, yet they eat dirt above and drink from yellow springs below—all with the same determination. Crabs have six legs and two pincers, but without a burrow like snakes or eels, they have nowhere to seek shelter—all because of their restless nature."
    ],
    "EngAge9":[
        "A noble person once said: 'Learning should never stop. It's like when blue dye is made from indigo plants and becomes even bluer than the plants themselves. Ice is made from water, yet it's colder than water. A straight piece of wood can be used to make a straight ruler, but when bent, it can be used to make a curved wheel. Even if a tree is old and tough, it can still be made straight again with the help of a wheel.",
        "So, when wood is guided by a rope, it becomes straight. When metal is sharpened, it becomes useful. A noble person learns extensively and reflects on themselves every day, thus gaining knowledge and wisdom, and acting without making mistakes.",
        "I sometimes think all day long, but it's not as good as a moment of learning. I sometimes look up from below, but it's not as good as having a broad view from a high place.",
        "Climbing high doesn't make your arms longer, but you can see far. Calling with the wind doesn't make your voice faster, but others can hear you clearly. Using a carriage and horse doesn't make your feet faster, but you can travel far. Using a boat and oar doesn't mean you can swim, but you can cross rivers and seas. A noble person isn't born different, but they use what they have well.",
        "When dirt piles up, it creates mountains, and they grow taller when there's wind and rain. When water collects, it forms deep ponds, and dragons and serpents come forth. When good deeds accumulate, virtues are formed, and divine spirits manifest naturally, and a noble heart is fulfilled.",
        "Therefore, if you don't accumulate small steps, you won't be able to travel a thousand miles; if you don't gather small streams, you won't be able to form rivers and seas. A fast horse can't leap ten steps at once; but through perseverance, even a slow horse can accomplish great deeds.",
        "If you carve but stop halfway, even rotten wood won't break; if you carve without stopping, you can carve into gold and stone. Worms have no claws or teeth, and their bodies are weak, yet they eat dirt above and drink from yellow springs below—all with the same determination. Crabs have six legs and two pincers, but without a burrow like snakes or eels, they have nowhere to seek shelter—all because of their restless nature."
    ],
    "EngAge12":[
        "A noble person said: 'Learning should never cease. Just as blue dye is derived from the indigo plant but appears bluer than the plant itself. Ice is formed from water, yet it's colder than water. A straight piece of wood, when used as a ruler, maintains its straightness, but when curved, it becomes a wheel. Even if a tree is old and tough, it can be straightened again with the aid of a wheel.'",
        "Therefore, when wood is pulled by a rope, it becomes straight. When metal is sharpened, it becomes sharp. A noble person seeks broad knowledge and daily introspection, thus achieving understanding and wisdom, and acts without fault.",
        "I've spent entire days lost in thought, yet it's not as fruitful as a moment of dedicated learning. I've looked afar from the ground, yet it's not as enlightening as having a comprehensive view from a high place.",
        "Ascending to a high place doesn't lengthen your arms, yet you can see far. Calling with the wind doesn't speed up your voice, yet others hear you clearly. Using a carriage and horse doesn't quicken your pace, yet you can travel great distances. Using a boat and oar doesn't require swimming skill, yet you can navigate rivers and seas. A noble person isn't born with extraordinary abilities; they excel in making good use of resources.",
        "Accumulated soil becomes mountains, stirred by wind and rain; accumulated water becomes deep pools, giving rise to dragons and serpents; accumulated goodness becomes virtues, and divine clarity is achieved, with a noble heart fully prepared.",
        "Hence, without accumulating small steps, one cannot cover a thousand miles; without gathering small streams, one cannot form rivers and seas. A high-spirited horse cannot leap ten paces at once; but with perseverance, even a slow horse can achieve success.",
        "If you chip away but abandon it halfway, even rotten wood won't break; if you persist without abandoning, you can carve into gold and stone. Worms lack claws or teeth, and their bodies are frail, yet they consume dirt above and drink from yellow springs below—all with unwavering determination. Crabs have six legs and two claws, but lacking a burrow like snakes or eels, they have no refuge—all due to their restless nature."
    ],
    "EngAge18":[
        "A noble person once said: 'Learning should never come to an end. Just as blue dye is extracted from the indigo plant but appears bluer than the plant itself. Ice is formed from water, yet it's colder than water. A straight piece of wood, when used as a ruler, maintains its straightness, but when curved, it becomes a wheel. Even if a tree is old and tough, it can be straightened again with the aid of a wheel.'",
        "Hence, when wood is influenced by a string, it becomes straight. When metal is honed, it becomes sharp. A noble person pursues extensive learning and daily self-reflection, thereby attaining insight and wisdom, and acts without error.",
        "I have often spent entire days pondering, yet it does not compare to a moment of focused learning. I have often looked up from below, yet it does not compare to the expansive perspective gained from ascending to a higher vantage point.",
        "Ascending to a high place doesn't extend your arms, yet you can see far. Calling with the wind doesn't accelerate your voice, yet it carries far. Using a carriage and horse doesn't increase your speed, yet you can cover great distances. Using a boat and oar doesn't imply proficiency in swimming, yet you can traverse rivers and seas. A noble person is not born with inherent superiority; they excel in making effective use of available resources.",
        "When earth accumulates, it forms mountains, rising with the influence of wind and rain; when water accumulates, it creates deep pools, giving birth to dragons and serpents; when good deeds accumulate, virtues are cultivated, and divine insight is attained, with a saintly heart fully equipped.",
        "Therefore, without accumulating small steps, one cannot reach a thousand miles; without gathering small streams, one cannot form rivers and seas. A spirited horse cannot leap ten paces at once; but with persistent effort, even a slow horse can achieve greatness.",
        "If you chip away but give up midway, even rotten wood won't break; if you persist without wavering, you can carve into gold and stone. Worms lack claws or teeth, and their bodies are frail, yet they consume dirt above and drink from yellow springs below—all driven by the same steadfastness. Crabs have six legs and two claws, but without a burrow like snakes or eels, they have no refuge—all due to their restless nature."
    ]
}